{"uk.fiveaces.nsfc":{"title":"New Star Manager","description":"*** The #1 game in AppSpy.com's Top 10 of 2018! ***\n\nWelcome to New Star Manager: The critically acclaimed game from Simon Read, creator of the BAFTA Award-winning New Star Soccer series.\n\nTake control of New Star FC – a beleaguered soccer club which needs your management skills and instincts to unlock the team's potential and make it to the top of the game.\n\n   “If you love football…you’d be mad not to download it” The Guardian\n\nThis is soccer management like you've never experienced it - Be more than just a player, be the head, the heart, and backbone of New Star FC. Be the Manager.\n\n   “New Star Manager takes the frame of the original game, and builds something utterly wonderful on top of it”  10/10 - Pocket Gamer\n\nTOTAL CLUB CONTROL\nTake ownership of every aspect of New Star FC, from constructing vital club facilities and managing the players' training regimes to choosing the perfect sponsor and hiring or firing the backroom staff!\n\nFULL SQUAD GAMEPLAY\nUse every member of your team to set up and score pivotal goals with on-pitch gameplay, using innovative controls designed specifically for phones and tablets!\n\nREAL SOCCER TACTICS\nBuild your dream squad, choose your winning formation, make tactical substitutions, and even step into the locker room for some half-time motivation!\n\nOFF-PITCH DRAMA\nHandle volatile players and get their mind back in the game by monitoring their concerns, outbursts, and quirks. Keep the board off your back, navigate the hostile waters of the sporting press, and make sure the fans keep believing... while keeping a careful eye on the club's finances!\n\nGLOBAL FOOTBALL\nDive into realistic simulations of the world’s biggest leagues and cup competitions!\n\nTHE NEW STAR SOCCER EVOLUTION\nExperience the newest instalment of the New Star series, whose pick-up-and-play sports titles have already been enjoyed by over 30 million players!","descriptionHTML":"*** The #1 game in AppSpy.com&#39;s Top 10 of 2018! ***<br><br>Welcome to New Star Manager: The critically acclaimed game from Simon Read, creator of the BAFTA Award-winning New Star Soccer series.<br><br>Take control of New Star FC – a beleaguered soccer club which needs your management skills and instincts to unlock the team&#39;s potential and make it to the top of the game.<br><br>   “If you love football…you’d be mad not to download it” The Guardian<br><br>This is soccer management like you&#39;ve never experienced it - Be more than just a player, be the head, the heart, and backbone of New Star FC. Be the Manager.<br><br>   “New Star Manager takes the frame of the original game, and builds something utterly wonderful on top of it”  10/10 - Pocket Gamer<br><br>TOTAL CLUB CONTROL<br>Take ownership of every aspect of New Star FC, from constructing vital club facilities and managing the players&#39; training regimes to choosing the perfect sponsor and hiring or firing the backroom staff!<br><br>FULL SQUAD GAMEPLAY<br>Use every member of your team to set up and score pivotal goals with on-pitch gameplay, using innovative controls designed specifically for phones and tablets!<br><br>REAL SOCCER TACTICS<br>Build your dream squad, choose your winning formation, make tactical substitutions, and even step into the locker room for some half-time motivation!<br><br>OFF-PITCH DRAMA<br>Handle volatile players and get their mind back in the game by monitoring their concerns, outbursts, and quirks. Keep the board off your back, navigate the hostile waters of the sporting press, and make sure the fans keep believing... while keeping a careful eye on the club&#39;s finances!<br><br>GLOBAL FOOTBALL<br>Dive into realistic simulations of the world’s biggest leagues and cup competitions!<br><br>THE NEW STAR SOCCER EVOLUTION<br>Experience the newest instalment of the New Star series, whose pick-up-and-play sports titles have already been enjoyed by over 30 million players!","summary":"Be More Than Just A Player","installs":"1,000,000+","minInstalls":1000000,"maxInstalls":4293997,"score":4.4307694,"scoreText":"4.4","ratings":131818,"reviews":623,"histogram":{"1":6077,"2":3376,"3":6752,"4":27011,"5":88531},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$1.49 - $64.99 per item","androidVersion":"5.1","androidVersionText":"5.1","developer":"Five Aces Publishing Ltd.","developerId":"Five+Aces+Publishing+Ltd.","developerEmail":"support@newstargames.com","developerWebsite":"http://www.newstargames.com","developerAddress":"Calder House\nHealey Road\nOssett\nWest Yorkshire\nWF5 8LN\nUK","privacyPolicy":"http://www.newstargames.com/content/text/privacy/Privacy","developerInternalID":"Five+Aces+Publishing+Ltd.","genre":"Sports","genreId":"GAME_SPORTS","icon":"https://play-lh.googleusercontent.com/M46AXck-yfwNdtWvtbYy0w8pUOnVVtdYtknGOtN_EkI2TyRbxkjS9Dd6jxzbhCNZhcs","headerImage":"https://play-lh.googleusercontent.com/HzXWL0IyDf2Ul0iGSwmVtFHwNT3tMJLgWTEzA2vx8brWUWhmxD0OAUm__NH6myXQdg","screenshots":["https://play-lh.googleusercontent.com/wHXtF-Ytbq0p2aus_yE1gHTGVVd0ZXHPkgph_2IExtm4z7aJVoZpFP6inbDR0qxxvVI","https://play-lh.googleusercontent.com/SspoXmPmX220mvngDBUJiDrbVq-DVbLhmRoRWPmxRhNMsgK2sj4kU3tOfLUKnVN9nQ","https://play-lh.googleusercontent.com/dVsRZ0fpSCBjaX3LX5gSU8yZLNNmbhrY2ft2-yHNoBTDHiH2xgkiqI68zMU-8YYUYumV","https://play-lh.googleusercontent.com/UtEY7LbVIn1GhnKJvNUBqGjk5Ch9MqT0i-xVxLTRpF5lvO9BWyKIz3qvF7K0DGDr9g","https://play-lh.googleusercontent.com/wgFY-cVvfemxKGFhOqVj0ALb1yH-I_rYkYNelrGhaUnZasramHMSQ59DJHmCxjnQqw","https://play-lh.googleusercontent.com/ArrcbYZD0KQCKuOQ563f8lG0J3UadA4anUTPs3PKbCuAA4aXavYfpW5UpeY-xaGH5FV6","https://play-lh.googleusercontent.com/X6jUTJBGNYdLoU4gHWBPH6fDYGQXRLd586qC5WHBuvXi-ZWdPqwtoxuyWA-PTonz7cxu","https://play-lh.googleusercontent.com/m0LC1WZrGtmczf0h2YPEzvE-hzgUejUDu17VPdcz9RfS_oGxPOMDKvQqvNnjl3tZ","https://play-lh.googleusercontent.com/t-3jfWO71KoQqq-Hg1B9F53ND26TOtleQhTG20q1Skfsl9YiDBntO2ihEMqzD_8TbHfe","https://play-lh.googleusercontent.com/560Z1BmB2V1cIq43g8prJOAYaXYsJKOKcFNFZ5ZgKPqARNrOSxZ23qoDBfNmdWxe618","https://play-lh.googleusercontent.com/AjydlwUb4dTemnCKcQZdug6ZOeDPlSnIGPUx9-veZl594ksL1K6iYnVl8HDMGmLfJrE","https://play-lh.googleusercontent.com/Aw7F9fctIp9a5FV99vYhYfN5scckfFakKMcUBGpud_i7fiqpdBXbfP4-HEJX0uj81yDB","https://play-lh.googleusercontent.com/nu1zuX_90ll0AMZsDc9ysYLKnaNrYjRLcm0ffR73-HmSLwVHyFxiK8iwUDXqszUcag","https://play-lh.googleusercontent.com/YRYJdA-y5Al3f4eNypQ1Ti6sRmJGOI1Pa7Y-FkgKWZOEx8YufOGodJ69fYQTyZaOZuE","https://play-lh.googleusercontent.com/ImROjBcnroodU73EJ0k4paKflHnWF2j25gTr8zRHCCt4bnG0AJOwYemhGlGbwdMLxpv6"],"contentRating":"Everyone","contentRatingDescription":"Alcohol Reference","adSupported":true,"released":"Aug 30, 2018","updated":1652781386000,"version":"1.7.2","recentChanges":"Version 1.7.2 updates certain 3rd-party software elements to ensure continued stability and compatibility.<br><br>This an important update and all users should update their app in order to continue using this game&#39;s services.","comments":["Pretty good managerial game, rather complicated but that at least makes sense if you are on the coaching side of things & responsible for the whole team. There are numerous moments in-game where your assistant manager pitches in with advice which can help. The complexity does impede on gameplay too much for me but worth a try if you're a fan of this type of management in your football games. After giving it a go am sticking with NSS as there is just way too much to deal with here.","I never leave in actual worded review on anything but I have been playing this game for quite a while now and it's amazing. To anyone saying you need to buy cards to keep up, I just beat Champ league brentford while still in league2 with a 35 avg team. It's not easy by any means, but its possible. Like any team game, just know who your Strikers are, make sure every player gets at least some playing time, and pick and choose who gets training and when. Great game overall!","The game is extremely fun. The amount of stuff you have to take into account can be overwhelming, but it's a good challenge. The game play is good as well. Dribbling is kind of awkward because you have to pull back but then it's hard to stop and pass without going into shooting mode and hitting cancel. Progress through the bottom league is good, but the moment you get promoted your toast. You have to buy players because you'll barely get any scoring attempts in the second leave with you mid 30/low 40 players. You loss and everyone will be unhappy. I'd be willing to buy a pack, but the 1, 2, or 3 players you'd get for $10 will not make a difference with the rest of your squad being so low and not having any depth.","Good game, ruined by need to buy cards. Been playing nss for years and played this one now and then. The gameplay itself is great and hard to put down when you get into it. However, I am sick of losing by 1 goal no matter how many I get and all concern bars filling up, leading to poor play and losing key players after a few seasons. The entire experience and team frustratingly falls apart after a few good days play and is basically a waste of time.","Honestly great game but it still has its flaws. One is that you can't bend the ball nearly as well as you could in new star soccer. This makes it nearly impossible to hit free kicks and honestly this causes free kicks to put you in a worse situation. It piles defenders into the box and with no way to shoot you have to pass and hope you can get a scoring opportunity with 7 defenders in the box. But besides this and having to tank the second season because you aren't anywhere near good enough to be where you get promoted to this game is great."],"appId":"uk.fiveaces.nsfc","url":"https://play.google.com/store/apps/details?id=uk.fiveaces.nsfc&hl=en&gl=us"},"com.pixelbite.xwt":{"title":"Xenowerk Tactics","description":"Play the first part for free. Get access to the full game with an in-app purchase.\n\nPlay as the commander of an emergency response team after a disaster at a secret lab, hidden deep in the arctic region. Your task is to cover up and maximize profits for the Xenowerk corporation, or to save the world, depending on whom you ask...\n\nEXPLORE\nDeploy squads on expeditions into the infected zone. Explore a ferocious landscape scattered with remnants of Xenowerk's absurd research facilities. Use skills, traits and mutations to mitigate the dangers, horrors and mishaps during your journeys. \n\nPush your operatives to the limit, not to waste any precious time. Explore jungles, swamps, laboratories, shelters and factories. Scavenge for valuable resources. Carry out various missions. Secure strategic safe zones. Find and rescue M.I.A. operatives.\n\nFIGHT\nControl your squad in real-time combat against hordes of mutants. Use operative skills and mutations, such as Frag Grenade, Bait & Trap, Adrenaline, Pyrokinesis and much more, to skew the odds in your favor. Activate Tactical Pause at any time to give more detailed orders.\n\nMANAGE\nRecruit and evolve Marines, Rangers and Scientists as your operatives. But choose wisely, some may obtain dubious traits or mutations.\n\nSpend gathered resources to enhance your base of operations; Barracks, Recruitment, Field hospital, Armory, etc. Spend earnings on treatments, upgrades and recruitment.\n\nCater for the whims of the Xenowerk Management to keep getting funded. Earn some extra cash-under-the-table by selling off resources on the Black Market. Or maybe try to save the world...\n\n\n• Single Player off-line game. No connection required.\n• Tactical squad-based, real-time combat.\n• World map exploration with loads of handcrafted and generated missions.\n• Home base management and character development.\n• Beautiful graphics rendered with physically based techniques.\n• Keep up to 10 different save games and store them in the cloud.\n• English, Deutsch, Français, Español, Italiano, 简体中文, 한국어, 日本語, 繁体中文, русский, Português do Brasil","descriptionHTML":"Play the first part for free. Get access to the full game with an in-app purchase.<br><br>Play as the commander of an emergency response team after a disaster at a secret lab, hidden deep in the arctic region. Your task is to cover up and maximize profits for the Xenowerk corporation, or to save the world, depending on whom you ask...<br><br>EXPLORE<br>Deploy squads on expeditions into the infected zone. Explore a ferocious landscape scattered with remnants of Xenowerk&#39;s absurd research facilities. Use skills, traits and mutations to mitigate the dangers, horrors and mishaps during your journeys. <br><br>Push your operatives to the limit, not to waste any precious time. Explore jungles, swamps, laboratories, shelters and factories. Scavenge for valuable resources. Carry out various missions. Secure strategic safe zones. Find and rescue M.I.A. operatives.<br><br>FIGHT<br>Control your squad in real-time combat against hordes of mutants. Use operative skills and mutations, such as Frag Grenade, Bait &amp; Trap, Adrenaline, Pyrokinesis and much more, to skew the odds in your favor. Activate Tactical Pause at any time to give more detailed orders.<br><br>MANAGE<br>Recruit and evolve Marines, Rangers and Scientists as your operatives. But choose wisely, some may obtain dubious traits or mutations.<br><br>Spend gathered resources to enhance your base of operations; Barracks, Recruitment, Field hospital, Armory, etc. Spend earnings on treatments, upgrades and recruitment.<br><br>Cater for the whims of the Xenowerk Management to keep getting funded. Earn some extra cash-under-the-table by selling off resources on the Black Market. Or maybe try to save the world...<br><br><br>• Single Player off-line game. No connection required.<br>• Tactical squad-based, real-time combat.<br>• World map exploration with loads of handcrafted and generated missions.<br>• Home base management and character development.<br>• Beautiful graphics rendered with physically based techniques.<br>• Keep up to 10 different save games and store them in the cloud.<br>• English, Deutsch, Français, Español, Italiano, 简体中文, 한국어, 日本語, 繁体中文, русский, Português do Brasil","summary":"Apocalyptic adventure with tactical squad-based combat.","installs":"100,000+","minInstalls":100000,"maxInstalls":458135,"score":4.340909,"scoreText":"4.3","ratings":8798,"reviews":524,"histogram":{"1":662,"2":194,"3":328,"4":1861,"5":5731},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$7.99 per item","androidVersion":"7.0","androidVersionText":"7.0","developer":"Pixelbite","developerId":"6991001366548054138","developerEmail":"support@pixelbite.se","developerWebsite":"http://www.pixelbite.se","developerAddress":"Oceangatan 3\n25225 Helsingborg\nSweden","privacyPolicy":"http://www.pixelbite.se/PrivacyPolicy.html","developerInternalID":"6991001366548054138","genre":"Strategy","genreId":"GAME_STRATEGY","icon":"https://play-lh.googleusercontent.com/7h2NPY5ne5gTMGUA4BPcSJzSpPZvZr35DM4SIrQrh_9RG7qePCJD7Ow6HTVlM5VJbJs","headerImage":"https://play-lh.googleusercontent.com/nfQN-gOIqseFMzAAVjePTIkmuE7G-4520O2na1wPE_1nxNCQ-EdSYInzrLTx50p0Owp-","screenshots":["https://play-lh.googleusercontent.com/CMgVHQ7UWFjp2lGtKhSTPTMKc1YwmgJ-lGaJcGLa52HpAtlLHw8G9GXZzqybGVIhhpw","https://play-lh.googleusercontent.com/aWQrOzdXEAwj8uty9W8t-BH71tRG1DaYF4PbEizbC1RmiZeVw256nYn_lcfF6Mvh1_Y","https://play-lh.googleusercontent.com/pYnBDSWf5OhkG8p8XxmsRYH47EO9Zch6N9xdSQnC_m7y_Hq2oJoVWKEjHUn2u9CDB_k","https://play-lh.googleusercontent.com/1lkVeMbecr6LD9u_DWizqnetF91fwttRjUbj2cu0W6eSimSr8MfJdpjhjg_w5We898k","https://play-lh.googleusercontent.com/bwbZbiANcNLVwiJCftO_IvENcHZw6euESjVeN76d2l8x2kxrXDtJ5ntwRLyYu4mHpAo","https://play-lh.googleusercontent.com/4bM-lk5btozADIx8mE-rtFHv6-vaTfMTT7oz4ig0EcwdV0cCSfO_JpkfRGaV4oeGFw","https://play-lh.googleusercontent.com/SDDYyITjYS-VlHbMSrlLAW2Zjv83AMWuAKzJeaKiz3p31GH_1L530ehatygv9gdNDss","https://play-lh.googleusercontent.com/15R26uMp6phqEP9XBibWuc8wDAqGV16aVevzGBA2sLGHgWvYhBevjucLqzgxtJCkTg","https://play-lh.googleusercontent.com/QajpKFIkCcx-V8EfiqzdGsiobSbgm3CXVZEYiCBsDXhapZWaj8AyHbr9dVahXHVZoP-E","https://play-lh.googleusercontent.com/6uTB8Kbf9-mIp4r37r6f5oWyDUpPwsjlJDEZ5XXPrF8I-XNclNUKawjZEG8PGb75b5s","https://play-lh.googleusercontent.com/3zOMhOlt5V_YSEojKsPMJDzkbuw1MyO1Lf_Ip4PIDe704sY9qquBdGTGR9vTwh8NO8Po","https://play-lh.googleusercontent.com/u6T2YfwxvwVMKfUFoFXA_2dMUCD90t71CQrWCzWdxsEVfLm6vmN5UrKDcLm15fvlu9o","https://play-lh.googleusercontent.com/2xFkuUzuTX4-fW7Szz_a33daqdwrcFfaZpQfBIuIBmZcKUiESKyH-p7svHyYAQXzAaxb","https://play-lh.googleusercontent.com/ITFI7a6goGA8cdbpwVYs16YUqHshpQMurC0wPo9jggUiYlPePqokHIoLzgcUK8_8Gjg","https://play-lh.googleusercontent.com/bWwHRWq335ykZ_6-U6053Fxj9seV7Acso2nkk5S_4Jfmp3VGGnDTIdIp6pVwFza_kVI","https://play-lh.googleusercontent.com/By6TOPwmKHMaNgqMJROCiw1IeyzksrvRE-lYW1QxQXnJk0-fGH6vAEWdSBuGLGgb3A","https://play-lh.googleusercontent.com/Ce1oZlFRI3h6nsTag8ydRgF0ZQD4X_CosFVgGAdSL17ECMYJ1MgY7y4zdn3sp8XrXrZb","https://play-lh.googleusercontent.com/hXSM81NNqq2T_shT6kfIRjLA_4_09-ZqGGCk9_5FMDqUJu0GVknck3UAN1R24U0liHY"],"video":"https://www.youtube.com/embed/AiJSIAtLgyE?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/nfQN-gOIqseFMzAAVjePTIkmuE7G-4520O2na1wPE_1nxNCQ-EdSYInzrLTx50p0Owp-","contentRating":"Teen","contentRatingDescription":"Violence, Blood","adSupported":false,"released":"Oct 9, 2019","updated":1592206612000,"version":"1.2.9","recentChanges":"Fixed a major bug in the Premium purchase flow. Update the game and contact support@pixelbite.se if you&#39;ve lost your Premium purchase.","comments":["Fun experience. I'd love to be able to edit the squad formation or at least make em closer or further apart. Runs smoothly n looks great I wish I could zoom in a greater amount to enjoy it more. An the invisible enemy stages in the beginning are brutal without the cage shield n other abilities. It's been challenging, I like the world map and its random events.","Overall good game! Devs would you look into the pathfinding? Sometimes when I DoubleClick a spot one of my ops will get stuck somewhere... Also different environments in the woods when we have to engage and kill monsters... I don't like the auto-shooting... Maybe you guys could have an option to turn it on/off?? Game looks really good! No lag or crashes ... I have my game settings on high and it's doing amazingly! 😊 one more thing, could you add a normal mode? Only easy & hard available atm...","Games actually disappointing. I got interested in this game due to another game they produced, Space Marshals 2. That, absolutely love so let's see what else they got. The mix of old school 80s animation and computer graphics, does NOT work here. Plus random events via cards, it should simply happen and not be a card draw situation. A better way to have a functional tutorial and yet be a \"make sense,\" in game flow: have people in the team do backstory missions. You see their abilities.","Enjoying and engaging gameplay. You gear and deploy a 3 man squad (maybe more later in game?) The squad members gain random useful traits/mutations as they level up. Many of these are very cool to use. In a more expensive game I would ask for more classes and maybe branching weapon selections for the squad to add more strategy but as it is, its a great experience for the price. I also am a fan of using the cards to showcase most of the information as they do most of the time here.","I paid for it after the demo period thinking there would be more substance, but there isn't. I find that there are too few enemies and too few abilities to really change things. It has a gameplay loop similar to XCOM with combat being more fast-paced. Easy was a bit of a mindless slog. Turned it up to Hard (there is no Normal), and the randomized abilities cause a lot of early game forced losses as it becomes too easy to be overwhelmed and you don't have any abilities to do anything about it."],"appId":"com.pixelbite.xwt","url":"https://play.google.com/store/apps/details?id=com.pixelbite.xwt&hl=en&gl=us"},"com.pixelbite.mutant":{"title":"Xenowerk","description":"Be the last hope against the mutant infestation.  Enter the aftermath of a scientific experiment gone horribly wrong.\n \nXenowerk™ comes from Pixelbite, the creators of Space Marshals. It is a top-down action shooter challenging your combat skills in an underground science lab. Descend deeper into the abyss and explore the tarnished levels. Armed with a flashlight as your main guidance, you’ll never know what’s lurking in the dark! \n \n \nMISSION\nYour objective is to destroy all the nests and eliminate all mutants to prevent them from spreading.\nXenowerk™ has 70 levels to explore with increasing difficulty. As progressing through the game you’ll come across a growing number of mutants and expanding areas to cleanse.\n \nARSENAL\nHeavier firepower and thicker armor is critical to stay alive on your journey. Gather pickups from slain mutants to power up weapons and armor.\n \nSPECIAL POWERS\nXenowerk™ features a set of special powers to boost your offensive when you’re in need. Activate one or several at a time for a more effective way to wipe out mutants.\n \nKEY FEATURES\n·         Top-down action shooter\n·         Dual stick touch controls\n·         Beautifully rendered lighting and shadows\n·         Wide range of weapons and gear\n·         Upgradable weapons\n·         Special Powers to enhance your gameplay\n·         Performance based rating system\n·         Google Play Achievements & Leaderboards\n·         Optional in-app credit packages to purchase\n·\t  English, Deutsch, Français, Español, Italiano, 简体中文, 한국어, 日本語, 繁体中文, русский, Português do Brasil\n\n \n**************\nGame requires OpenGL ES 3.0 support\n**************\nIMPORTANT: Please note that this game requires a screen resolution of at least 800x540 to display GUI elements correctly. It may be playable at lower resolutions but it is not officially supported.\n\nNOTE: Xenowerk features advanced graphics. To optimize game performance you may want to close down any other running applications before launching the game.\n \nFor support enquiries: support@pixelbite.se\n\nFollow us on Twitter: @pixelbite\nFollow us on Facebook: https://www.facebook.com/pixelbite\nFor more epic games visit: http://www.pixelbite.se/","descriptionHTML":"Be the last hope against the mutant infestation.  Enter the aftermath of a scientific experiment gone horribly wrong.<br> <br>Xenowerk™ comes from Pixelbite, the creators of Space Marshals. It is a top-down action shooter challenging your combat skills in an underground science lab. Descend deeper into the abyss and explore the tarnished levels. Armed with a flashlight as your main guidance, you’ll never know what’s lurking in the dark! <br> <br> <br>MISSION<br>Your objective is to destroy all the nests and eliminate all mutants to prevent them from spreading.<br>Xenowerk™ has 70 levels to explore with increasing difficulty. As progressing through the game you’ll come across a growing number of mutants and expanding areas to cleanse.<br> <br>ARSENAL<br>Heavier firepower and thicker armor is critical to stay alive on your journey. Gather pickups from slain mutants to power up weapons and armor.<br> <br>SPECIAL POWERS<br>Xenowerk™ features a set of special powers to boost your offensive when you’re in need. Activate one or several at a time for a more effective way to wipe out mutants.<br> <br>KEY FEATURES<br>·         Top-down action shooter<br>·         Dual stick touch controls<br>·         Beautifully rendered lighting and shadows<br>·         Wide range of weapons and gear<br>·         Upgradable weapons<br>·         Special Powers to enhance your gameplay<br>·         Performance based rating system<br>·         Google Play Achievements &amp; Leaderboards<br>·         Optional in-app credit packages to purchase<br>·\t  English, Deutsch, Français, Español, Italiano, 简体中文, 한국어, 日本語, 繁体中文, русский, Português do Brasil<br><br> <br>**************<br>Game requires OpenGL ES 3.0 support<br>**************<br>IMPORTANT: Please note that this game requires a screen resolution of at least 800x540 to display GUI elements correctly. It may be playable at lower resolutions but it is not officially supported.<br><br>NOTE: Xenowerk features advanced graphics. To optimize game performance you may want to close down any other running applications before launching the game.<br> <br>For support enquiries: support@pixelbite.se<br><br>Follow us on Twitter: @pixelbite<br>Follow us on Facebook: https://www.facebook.com/pixelbite<br>For more epic games visit: http://www.pixelbite.se/","summary":"An action shooter packed with mutants!","installs":"5,000,000+","minInstalls":5000000,"maxInstalls":7850814,"score":4.480161,"scoreText":"4.5","ratings":249677,"reviews":6859,"histogram":{"1":9468,"2":4583,"3":14928,"4":48234,"5":172433},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $49.99 per item","androidVersion":"4.3","androidVersionText":"4.3","developer":"Pixelbite","developerId":"6991001366548054138","developerEmail":"support@pixelbite.se","developerWebsite":"http://www.pixelbite.se","developerAddress":"Oceangatan 3\n25225 Helsingborg\nSweden","privacyPolicy":"http://www.pixelbite.se/PrivacyPolicy.html","developerInternalID":"6991001366548054138","genre":"Action","genreId":"GAME_ACTION","icon":"https://play-lh.googleusercontent.com/N8Yi_8ch22QVLf2FVX_o3AJ2yr3M3EaVAoe1hI6LQFBAx7JS-vyo_ZJsZYHIz5B-uHw","headerImage":"https://play-lh.googleusercontent.com/Xi1HAbAXN6aivf9NmRW5fFExxodJK78tysu3WrRK_GV2SSAist55dCkoN1btP1fax3A","screenshots":["https://play-lh.googleusercontent.com/8b84riZYv-m-zoYs_RHn8MpdqLUaoPLGSEOeoQnXfIt7EUe7UhxKcGXvLOHxQ3qc5Q","https://play-lh.googleusercontent.com/L3nowge9Jn6NHVtIsvcv0q42fhsFnUdggE9e4TWTG_msPZD5UMTIHwzp2zEWsUlZD1I","https://play-lh.googleusercontent.com/P7odoYeRVJJ4a7FCXKOHNFoBzJUc6AFZvmQqosXRem-slriXSXv4Ngz6DX7DPzoi4A","https://play-lh.googleusercontent.com/jAmqYeA0lTMMAQQPCR8UsxwdF_7lHd5PtQ7VNZgTYdVY9ERgdPR6VuclXK7r8ij1Nh0","https://play-lh.googleusercontent.com/d2aEk2k9wmu49KMuwOEMm9XjXW14Zl6XBFjxuRIR9a0nfVhe26yTW-3A_zdfjgs14Rg3","https://play-lh.googleusercontent.com/vlqnDUPeXowUIycb7g5nTa6_-jfILixNLNcBb7HO_Zb-NDUUJf5f-i0NljKcSZYwleg","https://play-lh.googleusercontent.com/PVJdZIUCiOBMYdt_D9sMoFqRVOm9N33Tsml5lHnX0f4QQ99VUbtxCzBReqbWp8Dc3SHA","https://play-lh.googleusercontent.com/xtOmpI2UgBkr1Avd8hA_f3z-XWwshGb_06TfuNjA0kQgxDj4SuxzPTbeK-GxEJdjLQ","https://play-lh.googleusercontent.com/YDmGMwaDaWx0z2k7rpWLRcwRW9YszaA4gb2eZvzS85lke3_MiF4Vw29iQ5pT1W_xkyQ","https://play-lh.googleusercontent.com/2VpEbbxHN53C3HyCXB-6lAaUXgjppvkmTizmuPfJPpIc0DvK-_rbPxtKqTXsG_U-eei1","https://play-lh.googleusercontent.com/Emzjh7fgKE62ZesxFvCAEokdYFvJf-xy0ctdRkLWmQWTsgHgBUGhgVn9VggKk8rBm5I","https://play-lh.googleusercontent.com/-TyIGTN6_axOwrcZnoN1KUxLACbOGVXRpNKoWitpv30Pn8ypjTt2XjOf4d0OtUhx5zM","https://play-lh.googleusercontent.com/BQPjtH_eQWU4-QPnyhaFfTuP1xlUAJNHy8qDCOmrIuCvPegQZkL8iynxrqWM5V6KTg","https://play-lh.googleusercontent.com/dwBWOfLEgjuyxqY8kgFFTFklp51jMxCQuQGxIc0NTkFvhxDmV3POQ_sDAzM3oq61Egk","https://play-lh.googleusercontent.com/sT0WaX_sUrtX-IIl7LVyMUWcqd0e-FDiy7D6_sMpuGw2Thofq7SoAwXFqYamQ5aYVCfD","https://play-lh.googleusercontent.com/Big2qD0VPa-XBRQvzx0g73JV3iHmSIVSaiz2RPoHs2J8fBoNsNe0qj_Xuv8fr30SVuY","https://play-lh.googleusercontent.com/V8So5tkBh2khy1zm4W8AwFoonCIM0IynaEINcQcpck6gz_Ohzhd3gqscWyyQKyzVuUQ","https://play-lh.googleusercontent.com/6C9YTvGFO3BikcJSRRmjMZluOpkgLSQSbmFE1YO19MVJnn79keqP_b135WICy0Rg1qaf","https://play-lh.googleusercontent.com/k82Z9jCZNVOhpYJWiBahGfRLDoFP1XicsO_H6Wm-b8fYJ7KLsGYt06sQ1nfD4O5SX8k","https://play-lh.googleusercontent.com/nDCB6ByrmTAhxevT0YawXl7jKEEoI1OxtzuAGgJbzzPAkkInoHPbxmNEOgn4Pq2Mww","https://play-lh.googleusercontent.com/E04mMS4SzVfMlGhbv7Gm6wK-WARSTxzaMVOr4PeVFnzRsSWPm-U69pcuDQmKrgkH-ls","https://play-lh.googleusercontent.com/PSEBxvCerOLX9OdsYA46Wyerk0Bb9CKPLw_-PL3OwdlaES9uia3AsXrNc92hz_J-yw","https://play-lh.googleusercontent.com/sf7o7cN_VpqNrLZjWhACffz7IMGJgWdVzDoAqQBHngXu593v7ULhJFskHt6lou293pE","https://play-lh.googleusercontent.com/d-Z3HjNcMiukvqV7YQVOSjHA2BUox-Jy9a_jlgRR_7N08Ly2JUC1RCUHjKTAfloHoA"],"video":"https://www.youtube.com/embed/DhDV5Vi1c6w?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/Xi1HAbAXN6aivf9NmRW5fFExxodJK78tysu3WrRK_GV2SSAist55dCkoN1btP1fax3A","contentRating":"Teen","contentRatingDescription":"Violence, Blood","adSupported":true,"released":"Jun 24, 2015","updated":1575016628000,"version":"1.6.0","recentChanges":"Stability improvements.","comments":["This game is old by now, but still totally worth it. It has micro-transactions (which I despise) but they were done correctly and not at all a nuisance. The gameplay loop is a solid, pick up and play for a few minutes one. The only reason I give it 4 stars is that all the levels are essentially visually the same. They're detailed and look good though, so it's only a minor complaint, frankly.","It's a great game, well it has potential to be great, 1. Missions need to be more hands, longer, and have better adjectives. 2. You should be able to buy (or earn) teammates to aid you. 3. It's currently boring how easy the enemies are to kill plus there's not many of them. 4. Just add some stuff like sas 3 did, well good luck with the game and keep at it.","Pretty awesome. A twin stick shooter with equipment upgrades. It works out of the box with my USB-C controller, and I couldn't be happier. It feels like a proper top-down action RPG, bit you can literally pick it up and clear a level with only five minutes to spare. Easy to pick up, have a minute of fun, and quit. Haven't even seen a single ad. This is not your usual Android store garbage.","The first time a free game wasn't shooting ads in my face every 10 seconds. Gameplay is reminiscent of Alien Swarm. It doesn't hold your hand, you might actually have to use your brain to pathfind through a level. The difficulty is fair, all around, looks like the kind of game that's worth someone's time. Makes me want to actually support the dev.","I enjoy this game. Graphics, game play, items/weapons leveling by experience gained from defeated aliens all well done. Only area I would immediately improve is what I can see while I'm playing. For example, the camera is close down to the level, which I like especially the destructible environment and details like writing on walls, desks, etc. However, sometimes when moving backwards away from the enemies, shooting at them, they'll be off the screen, can't see what I'm aiming at."],"appId":"com.pixelbite.mutant","url":"https://play.google.com/store/apps/details?id=com.pixelbite.mutant&hl=en&gl=us"},"com.noxgames.hex.civ.strategy":{"title":"Hex Polis: Civ Medieval War 4x","description":"Hex Polis is stylizated turn-based strategy game. Start civilization wars and build powerful medieval kingdom! Defeat foe with crusaders, knights and other unique warriors. This civ game is about controlling the hex map, exploring unknown lands, fighting other tribes and discovering technologies. Are you ready to test your tactical skills and rise humankind ?\n\nEach turn is full of adventure. You move on hex map and explore new hexes with warriors. Every warrior has special abilites which help you to conquer rival stronghold. There are stylized heroes: archers, sailors, dragons, crusaders and many more! Technology progress is the important part of your tactics. You can choose your focus - are you better farmer or warrior? Farms, mines and markets bring more coins to your production. More coins you have more actions you can do in each turn.\n\nHex Polis features: \n\n▶        Turn-based strategy game and kingdom maker\n▶        Humankind and dorfromatik like\n▶        4x - explore, expand, exploit and exterminate\n▶        Master technologies, explore hex map, wage war and build civilization of humankind\n▶       Train your warriors and win battles against other tribes\n▶       Possible to play offline but for better gaming experience is required to play online\n▶      Two game modes - normal and hard\n▶       Stylized in amazing low poly graphic\n▶       Civilization game & building civilization\n▶      Colonize world of politopia\n▶      Middle age atmosphere of civilization wars\n\nHex Polis is tactics game full of fighting, conquering and technology development. Expand from small village to powerful polis!\n\nExplore medieval fantasy world with many challanges ahead. It's your turn in civilization building!\n\nCreated by Noxgames 2022","descriptionHTML":"Hex Polis is stylizated turn-based strategy game. Start civilization wars and build powerful medieval kingdom! Defeat foe with crusaders, knights and other unique warriors. This civ game is about controlling the hex map, exploring unknown lands, fighting other tribes and discovering technologies. Are you ready to test your tactical skills and rise humankind ?<br><br>Each turn is full of adventure. You move on hex map and explore new hexes with warriors. Every warrior has special abilites which help you to conquer rival stronghold. There are stylized heroes: archers, sailors, dragons, crusaders and many more! Technology progress is the important part of your tactics. You can choose your focus - are you better farmer or warrior? Farms, mines and markets bring more coins to your production. More coins you have more actions you can do in each turn.<br><br><b>Hex Polis features: </b><br><br>▶        Turn-based strategy game and kingdom maker<br>▶        Humankind and dorfromatik like<br>▶        4x - explore, expand, exploit and exterminate<br>▶        Master technologies, explore hex map, wage war and build civilization of humankind<br>▶       Train your warriors and win battles against other tribes<br>▶       Possible to play offline but for better gaming experience is required to play online<br>▶      Two game modes - normal and hard<br>▶       Stylized in amazing low poly graphic<br>▶       Civilization game &amp; building civilization<br>▶      Colonize world of politopia<br>▶      Middle age atmosphere of civilization wars<br><br>Hex Polis is tactics game full of fighting, conquering and technology development. Expand from small village to powerful polis!<br><br>Explore medieval fantasy world with many challanges ahead. It&#39;s your turn in civilization building!<br><br>Created by Noxgames 2022","summary":"Civilization wars &amp; civilization building. Use hex tactics 4x and rise humankind","installs":"100,000+","minInstalls":100000,"maxInstalls":177584,"score":3.6904762,"scoreText":"3.7","ratings":652,"reviews":18,"histogram":{"1":155,"2":46,"3":15,"4":62,"5":372},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $99.99 per item","androidVersion":"5.0","androidVersionText":"5.0","developer":"NOXGAMES","developerId":"8223591372369919986","developerEmail":"info@noxgames.com","developerWebsite":"http://www.noxgames.com","developerAddress":"Čeňka Růžičky 18\nBrno\n62500","privacyPolicy":"http://noxgames.com/privacy_policy/hex/noxgames.com.html","developerInternalID":"8223591372369919986","genre":"Strategy","genreId":"GAME_STRATEGY","icon":"https://play-lh.googleusercontent.com/8dxSGvbvbClkDSAktlDXjntec99AJIjax_9v73CoRnjImwRCuwxg4MbsS2e2LHakmZCx","headerImage":"https://play-lh.googleusercontent.com/1XrrnWrZ8huAZZ0ytJLlOMPqYOFfe-72dzH2tJCxerwC9DcDVblnnETOKoTPgEnkIATA","screenshots":["https://play-lh.googleusercontent.com/kLL9q4V2ytMDs-YI1Ls-VEbmicOn2-LOA5sht_8XBt-B3E3gRay9oSoBXm0_iaLBwrg","https://play-lh.googleusercontent.com/s-Jf75beN7hBFwSjkQLMTQQW5MLg0H-YmhaGxzKLsKp5gyrK8oVmq6AQGH_B88peZAM","https://play-lh.googleusercontent.com/ZtK2hcZ0eHqlcFfHennJwV54vj7WdXNyhA-kQX_Pv9EYWonVxik0I3qKtyndEZWSYg","https://play-lh.googleusercontent.com/-RN32ccrVkQ_OWuiY6EumJnJVUUcW6UkBpX4FB_rd1DvEGlh5COu8qs1mabQtbFoC_s","https://play-lh.googleusercontent.com/3pcBMaSSc3WxsJHp9xjWbdDk_78i3LtwXEsRVYNs1_TPQ0u9gsoBa9UeHqK3f6Y9Jw","https://play-lh.googleusercontent.com/b3ZAMdUkNJax-oS18PomYWSbtNFolJd07pEhu1dYpXWJNXzb__g8vchKMynl-9ECY2U","https://play-lh.googleusercontent.com/dvqUtrLileySaYhsDFp3t-7tJa41nybWG2n0acciURuXXIcMqYBpl6kfZdvqLrbjRkrO","https://play-lh.googleusercontent.com/Qn3yPNq2Yaevyx7i-Fo8Ce0zfkJZYk-2xAySumvzmqs87o_hSTMTAndpEzFg_qWF9LUI","https://play-lh.googleusercontent.com/V9Z_wg8W3_y30AA0bMoMAvI2Egr9HLOXMotUT2jJ6gwlXvlurt_rw3b4gjTAOtEHWOw","https://play-lh.googleusercontent.com/OA7Gq5pH8iV5BOf63P79Wr-9rGJ2I7UTIcLmDCsf1lY5XuW0-z5RLO7YR3R1xAenm4s","https://play-lh.googleusercontent.com/WeJdm6EiFiPENWoATwYCJGwzRviE4rgD-jvaIgar_nXXnbmH752dkh0d4gY5KVE_wvo","https://play-lh.googleusercontent.com/2cu_WjewlOkhtqEXez3HgBhk7jSpj4wL3ezhbsukhWjog6NjREpORAvMQ2La1-SCvw"],"contentRating":"Everyone 10+","contentRatingDescription":"Fantasy Violence","adSupported":true,"released":"Apr 21, 2022","updated":1661535521000,"version":"0.3.10","recentChanges":"Update contents:.<br>- Stability improved<br>- Watch towers bonuses reworked<br>- Issues with UI fixed<br>- Improved performance<br>- Multiple reported issues fixed<br>- User feedback implemented","comments":["Great game! Fun Civ-esce feel but also with its own originality. No complaints on ads, as the rewards justify them (which can be quite short at times). Only thing I think: lower the price of certain packages and I will gladly pay. I want to feel like I'm getting MORE than what I'm paying for. It is, after all, digital 🤪 Overall: this game keeps my attention, for now. Lol","I absolutely love this game! Not a pay to play. Reminds me of the original Warcraft game style and energy.Great pace of play as well as a balance in upgrading. Please keep up the great work. Any chance of a one time remove all ads option?","I enjoy this game quite a lot, but I have a few critisisms. Unit previews don't show how far a unit can see. A unit with 2 sight nullifies the effects of watchtowers. A unit's standing animation usually slants to the side, making telling what tiles you can backstab from a bit awkward, if not worse because you can't take back movement options you select, meaning you can't try a side without commiting to it. Those are my gripes with the game.","Do not get this game. You play through levels so short there's barely any point to playing them. Its a naked money grabbing rip off of polytopia. The facing system really sucks, your guys spawn with their back facing the enemy so you get back stabbed straight up. So many things to pay for, its just awful. Don't waste your time.","This is a grueling obvious rip off of polytopia accept worse atlease it takes a few minutes to go through a round of polytopia in this I can barely get a few upgrades before my beginner unit bodies the enemy I think a larger scale map would be a huge improvement and tiles that slow but don't block units similar to what a game called unciv does"],"appId":"com.noxgames.hex.civ.strategy","url":"https://play.google.com/store/apps/details?id=com.noxgames.hex.civ.strategy&hl=en&gl=us"},"com.noxgames.mage.hero":{"title":"Mage Legends: Wizard Archer","description":"Roguelike super wizard RPG - Become magical archero and slay monsters in multiple dungeon battles. Can you survive with your magical wand and staff?\nAre you ready to enter a world where tons of evil enemies and fantasy monsters want to eliminate you? \n\nYou're the only mage hero with powerful spells who is able to resist and defeat the oncoming evil. Rise up from the ashes and become a legend in the age of magic. Enjoy this rpg adventure game and fight all fantasy monsters right now!\n\nMore enemies you kill the more stronger you'll get. Fight for epic loot, treasures, items and valuable equipment to make you stronger and more powerful! You will have to deal with countless monsters and monster legends. Be a hero in the neverending age of magic!\n\nDive into an roguelike, Archero-style game full of challenging quests, epic dungeons, and crazy waves of enemies. Collect rare equipment, weapons and skills. Kill monsters. Improve your legends. Enjoy the magic adventure!\n\nMage Legends features\n▶ Addictive, action-packed gameplay.\n▶ Many skills to help you crawl these dungeons.\n▶ Enjoy different locations.\n▶ Easy control with just one finger.\n▶ Different game modes.\n▶ Earn rewards and unique weapons.\n▶ Explore epic fantasy worlds as a true mage legend.\n▶ Challenging monster legends fights\n▶ Drag to move - release to hit\n\nNow the destiny of the world is in your hands! Master the art of moving, dodging and shooting. Become a pro shooter! Neverending magic adventure starts here and now! Start the road to hero in this magical world now! Be fast: run, dodge and shoot! Or be furious and go all-in with a storm of magic!\n\nMage Legends: Epic RPG Hero Archer Adventure Game is a roguelike action game. Unlike other Archero-like games, you will fight as a mage with magic skills. You will have to choose from multiple skills as you progress through the dungeons. Your choices will create different battle styles. It's up to you what you choose.\n\nWith just one finger you will decide if the world will be free once again or if you let the evil forces to rule the world forever! The gameplay is very easy and intuitive. Each battle is a challenge, survive waves of attack. Use spells to defeat all monsters, archers and the most legendary bosses in this adventure game.\n\nBattle through ancient forest, deadly desert, graveyard and inferno dungeon in your quest to save the world. Over a thousand dungeons are waiting for you to solve their mystery. You can move and shoot with one touch. Fight by magic against powerful enemies. Improve your unique skills and gain rare equipment that makes you stronger. Complete daily tasks and gain extra rewards and materials.\n\nIs the game too easy for you? Don´t worry. Try high difficulty mode and enjoy. Play the best hyper-casual ARPG game.\n\nWill you become the most legendary mage that is brave enough to stand up against the evil and bring back peace to the world? Hurry up! The evil is getting stronger and the world needs you now!\n\nCreated by Noxgames","descriptionHTML":"Roguelike super wizard RPG - Become magical archero and slay monsters in multiple dungeon battles. Can you survive with your magical wand and staff?<br>Are you ready to enter a world where tons of evil enemies and fantasy monsters want to eliminate you? <br><br>You&#39;re the only mage hero with powerful spells who is able to resist and defeat the oncoming evil. Rise up from the ashes and become a legend in the age of magic. Enjoy this rpg adventure game and fight all fantasy monsters right now!<br><br>More enemies you kill the more stronger you&#39;ll get. Fight for epic loot, treasures, items and valuable equipment to make you stronger and more powerful! You will have to deal with countless monsters and monster legends. Be a hero in the neverending age of magic!<br><br>Dive into an roguelike, Archero-style game full of challenging quests, epic dungeons, and crazy waves of enemies. Collect rare equipment, weapons and skills. Kill monsters. Improve your legends. Enjoy the magic adventure!<br><br><b>Mage Legends features</b><br>▶ Addictive, action-packed gameplay.<br>▶ Many skills to help you crawl these dungeons.<br>▶ Enjoy different locations.<br>▶ Easy control with just one finger.<br>▶ Different game modes.<br>▶ Earn rewards and unique weapons.<br>▶ Explore epic fantasy worlds as a true mage legend.<br>▶ Challenging monster legends fights<br>▶ Drag to move - release to hit<br><br>Now the destiny of the world is in your hands! Master the art of moving, dodging and shooting. Become a pro shooter! Neverending magic adventure starts here and now! Start the road to hero in this magical world now! Be fast: run, dodge and shoot! Or be furious and go all-in with a storm of magic!<br><br>Mage Legends: Epic RPG Hero Archer Adventure Game is a roguelike action game. Unlike other Archero-like games, you will fight as a mage with magic skills. You will have to choose from multiple skills as you progress through the dungeons. Your choices will create different battle styles. It&#39;s up to you what you choose.<br><br>With just one finger you will decide if the world will be free once again or if you let the evil forces to rule the world forever! The gameplay is very easy and intuitive. Each battle is a challenge, survive waves of attack. Use spells to defeat all monsters, archers and the most legendary bosses in this adventure game.<br><br>Battle through ancient forest, deadly desert, graveyard and inferno dungeon in your quest to save the world. Over a thousand dungeons are waiting for you to solve their mystery. You can move and shoot with one touch. Fight by magic against powerful enemies. Improve your unique skills and gain rare equipment that makes you stronger. Complete daily tasks and gain extra rewards and materials.<br><br>Is the game too easy for you? Don´t worry. Try high difficulty mode and enjoy. Play the best hyper-casual ARPG game.<br><br>Will you become the most legendary mage that is brave enough to stand up against the evil and bring back peace to the world? Hurry up! The evil is getting stronger and the world needs you now!<br><br>Created by Noxgames","summary":"Magic archero monsters slayer - Roguelike super wizard RPG &amp; Survival wand fight","installs":"500,000+","minInstalls":500000,"maxInstalls":737454,"score":4.5047617,"scoreText":"4.5","ratings":11701,"reviews":304,"histogram":{"1":668,"2":103,"3":438,"4":1890,"5":8576},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $399.99 per item","androidVersion":"6.0","androidVersionText":"6.0","developer":"NOXGAMES","developerId":"8223591372369919986","developerEmail":"info@noxgames.com","developerWebsite":"http://www.noxgames.com","developerAddress":"Čeňka Růžičky 18\nBrno\n62500","privacyPolicy":"http://noxgames.com/privacy_policy/privacy_policy_psc.html","developerInternalID":"8223591372369919986","genre":"Role Playing","genreId":"GAME_ROLE_PLAYING","icon":"https://play-lh.googleusercontent.com/KFqK99I581K6sFwk5kOHPCzBUyW-62jDCuXgFHnHp2FawgoOHPKAsQdrhfXiEElssQE","headerImage":"https://play-lh.googleusercontent.com/lBAuMCyYJ8eKQCj_FeAiUZwkcm1qvhrmgGrXOZ56HRS6-O1dRU1i00LK4EnP30FzakE","screenshots":["https://play-lh.googleusercontent.com/7ecLg8eG24E-Ar_9Rfap27U2yBsIbitY3_gnEpXoS2p-OzqPRgrQPwnQAlMYNA8HbhI","https://play-lh.googleusercontent.com/T-hr8mxGbmtTfEkfB0wsuVmHghqM5cdL3qHd7qaeznF52NDG5O1z3gVj94y68tcfEyI4","https://play-lh.googleusercontent.com/Yhj2GjdzfUq0tChH2YhgBzHnyKdAhmtYmYa4A1-TwEj54FLLh4lORuzP5qRo_GDMilU","https://play-lh.googleusercontent.com/Ja3Efu51D1BdPVDeIOi1PL-Cs9Zh-sJzLLXzTNgotJquhRvx3Kgus8yfCnG_XJqmYs4","https://play-lh.googleusercontent.com/2mWFv_W9AB7Bg4GIB1A3KBe7V00zKDdzZkcQ7uyjDtq_omO_gpzI39vAT3otH56tFS4","https://play-lh.googleusercontent.com/4KtscOHUnR-yaWm6O5mKvaseFx-n2dA1uUX7k3AJB9MMMlw97yOnyutDTYVO8lDb76w","https://play-lh.googleusercontent.com/DtCVIfeU_awAk2mJMAza6Q9eX4MDmu8BtIuvCXzLlJK3rFUaaeYPjyu5J_TAbqYkeA","https://play-lh.googleusercontent.com/ePDj8DCK9toqX-Xze_c5gCtAWN_e_7fPTPhFaPsBOAqgGNUA4C4yiLw_S0UnXJWvaFqF","https://play-lh.googleusercontent.com/LJZZ8leGWwQMuYDPb7SZT7ZKutfanefJOG4-XB3QVSniRDh8ip8dDc_TScvhoJqwNh-2","https://play-lh.googleusercontent.com/g9hLcSwjKxJeJe0WICNTmPAUqs1MBxZ1kA8rTPETGcqQo-HNj5YlGIG6nLTaRnMAgA","https://play-lh.googleusercontent.com/5xjZk4w79ogga-Oi1fLCrzmd47tfQKPNq9RChb-VrlzV2VD0KOyVe5MKOxacc8Ik6S8","https://play-lh.googleusercontent.com/WSqCem-TCx_CBk31jf0tETajyYzmlDCVlWTMzoX7TOgGM8xMd6RxXcOTWJytqpd_MqmQ","https://play-lh.googleusercontent.com/TDzprl5LLbOOq9h2lEzSoG7wTBk-8YRUVVGFMkki3d-Mx5d2Z9aWvuWJ10xl3SSoceU","https://play-lh.googleusercontent.com/7ZX6po0VmWqVWi5DXsYWKvdIRpNmMXgBbadl1NNXn5x10m6D02AuLldwehfWazRApAU","https://play-lh.googleusercontent.com/Y4RwODQm02CvQbuilGT5fG1v-g1S2cHc3W6UivursI0sobqJCgn3onwNhZUH2PLREw","https://play-lh.googleusercontent.com/BsSMx9ZqwSEjiboCHu3atfYZrqzp34-mC7Xt1P9ze15JonzbH7Bcj2Jz9mdxzSFBBLmH","https://play-lh.googleusercontent.com/8IjmdIzB2fahhL1L6TXA3BN1tyIYvDL-yuzdAjUb_jR1lwuMerJfF5CNy2KnqFnk8wJ_","https://play-lh.googleusercontent.com/m-Cna5EkX6aTIglQsWINb13XiPgra7dgDpB8R8rzx-5nfCNM_p3574qfWraWYAYhDd8","https://play-lh.googleusercontent.com/qOSSlFEjuH3ecYLKjGXThzEQNNfnm0gJJCdhZXDxScqhamkOcjxYTXcKGDAeIeIgKT0","https://play-lh.googleusercontent.com/xUK3aTnKqbABPDrH5tx1eoS88J810gQqKK5ICxTgvA9yBv0uaT_-nmjSLrYfGin98-Cw","https://play-lh.googleusercontent.com/yprHuFw3443RS8OALxmV5lcassPaKyCtgNc-IWRSqeePnKrGKVZb74-yrecsY0R_Ngi1"],"contentRating":"Everyone","contentRatingDescription":"Mild Fantasy Violence","adSupported":true,"released":"Apr 3, 2020","updated":1661430716000,"version":"1.6.2","recentChanges":"- Stage rewards changes<br>- Bugfixes and performance improvements","comments":["Good concept, greedy execution. There are ads for everything, and eventually the ads cause the app to close itself. Also, your pack prices are ridiculously high and they're not even good. No one will be paying $99.99, $199.99, or $399.99 to begin with, but you seriously think the reward of one item and handful of gems will entice anyone? Pure greed. Also, you have to grind so hard to get such little amounts of gold. I have so many scrolls I can't use to level my gear because of the tiny reward.","I can't wait for the city. I have to say this is a lackluster attempt in the shooter genre. It can't even get what it has copied, what every game in this genre slavishly copies, right. There is no progress counter so if you are taken out of the game you must start the chapter completely over. Some rooms repeat, some bosses repeat, even the hint of the day never changes reminding you to stop to shoot. I wanted to experience the unique city bent but I can no longer stand the game enough to do so.","04/30; fixed! 4/29: thank you! Updated 04/28 to say there's been 2 updates (at least) since my review and the Desert stage is still broken. Shielded enemies in level 46 don't register so you can't attack them and now they can't attack you, meaning you have to quit and waste what you earned. Fun, but stage 3, level 41-42 is bugged and you can't kill the enemies in it, stopping progress. Would like to give it a shot, but needs more equipment and the levels fixed","Better than Archero because equipment allows you to choose what abilities or skills you want to have. However, progress is painfully slow and equipment too hard to come by. The forge is pretty crappy. It only makes stuff I already have our don't need. Should be able to choose to try making a weapon or ring at the very least. Keep improving! Lots of promise.","I have been playing a lot of rogue-like shooting lately, and this game has more ad then the other simulator games like this one. I know you're trying to make money , but who wants to play a game that every powerups or free gears and have to wait 30 minutes to it. I know the simulator game doesn't add more ads then this game. Like the graphics,games play with different lvl powerups, and stage. I don't know the game save or if there is a way to save your game. Anyway that's my opinion when I play."],"appId":"com.noxgames.mage.hero","url":"https://play.google.com/store/apps/details?id=com.noxgames.mage.hero&hl=en&gl=us"},"com.gonzossm.sttt":{"title":"Suрer Toss The Turtle","description":"BLAST.CO shop is back in business, and the competition has just risen to a whole new level! Compete against your friends, and the world to be the ultimate turtle tosser!\nShoot as far as possible using cannons, guns, bombs, jetpacks, rockets, nukes, and a bunch of other cool gadgets! Choose from a variety of different animals to launch to your hearts content!\n\nFEATURES:\n✔ FREE TO PLAY\n✔ Numerous enemies and objects on the field\n✔ Many unique characters to toss around\n✔ Over a dozen different cannons and guns\n✔ New BOOSTER Items to ensure hours of fun\n✔ Over 80 Achievements\n✔ Bunch of other new amazing gadgets to help you hurdle further through the air\n✔ Cloud game saves\n✔ High quality graphics and sound design","descriptionHTML":"BLAST.CO shop is back in business, and the competition has just risen to a whole new level! Compete against your friends, and the world to be the ultimate turtle tosser!<br>Shoot as far as possible using cannons, guns, bombs, jetpacks, rockets, nukes, and a bunch of other cool gadgets! Choose from a variety of different animals to launch to your hearts content!<br><br><b>FEATURES:</b><br>✔ <b>FREE TO PLAY</b><br>✔ Numerous enemies and objects on the field<br>✔ Many unique characters to toss around<br>✔ Over a dozen different cannons and guns<br>✔ New BOOSTER Items to ensure hours of fun<br>✔ Over 80 Achievements<br>✔ Bunch of other new amazing gadgets to help you hurdle further through the air<br>✔ Cloud game saves<br>✔ High quality graphics and sound design","summary":"Use cannons, bombs and jetpacks to SHOOT your turtle as far as possible!","installs":"5,000,000+","minInstalls":5000000,"maxInstalls":8259368,"score":4.703863,"scoreText":"4.7","ratings":271980,"reviews":30931,"histogram":{"1":7310,"2":2973,"3":8099,"4":26169,"5":227417},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$1.99 - $19.99 per item","androidVersion":"4.4","androidVersionText":"4.4","developer":"GonzoSSM","developerId":"GonzoSSM","developerEmail":"Gonzossmllc@gmail.com","developerWebsite":"http://www.supertosstheturtle.com","developerAddress":"GonzoSSM, LLC\nP.O. Box 9563\nSpokane, WA, 99209","privacyPolicy":"http://www.supertosstheturtle.com/privacy-policy/","developerInternalID":"GonzoSSM","genre":"Action","genreId":"GAME_ACTION","icon":"https://play-lh.googleusercontent.com/2xSStDKJV60qBAJtJ3se2E200xrgna-8SDN7mp-mR7VyHy1KCNZnwGfvS4PqSSmbydQ","headerImage":"https://play-lh.googleusercontent.com/cSZzZNRKrRUleb_c7BjvT9_5uJhPihkzaCUcbByVAKlWL0mxQdvu8JeTSjnHte8v4-8","screenshots":["https://play-lh.googleusercontent.com/od7FVtTY6wABl5KhZpLNZqJ-3d-EJdJcVr1YFAo7wn254h1eYe1449scLcd7I-3q0O8","https://play-lh.googleusercontent.com/GRzlipMvz6_4E95A6Vv-hX3HYzJCHbFjVUqcGFXsEA4FD789rzvguB5oZFKs0a7jR8zi","https://play-lh.googleusercontent.com/yCmg0J9tzN1GEXMnfYdZdWdc6vPszaOVT77KS8e9CSqBCij6i6HSj8YNOQZji_1GHmM","https://play-lh.googleusercontent.com/mqT3gaYHhDiJyd4qnLxKml_ZfteIp_3aHrxdPpf6q-ca-ZljPVcMySDdlqsMNvQUHhQ","https://play-lh.googleusercontent.com/555ZLDQltK26kGuC4DmUCVAKiovU66WePDST9kmGPpph98R9WjRD-hkZ4vK6m9mb9os","https://play-lh.googleusercontent.com/d4ZRVbqoyYOzOGUuaJtC7_Bpv9G_T2CUVjzH2I4mA5DCw9r6Yg-M3s_rBrTyzbZCFHg","https://play-lh.googleusercontent.com/gZsS2ge10ZI7-LdyBYTw29C1RX1okzqUNXp0ReL91K1OqzbrxrIV20OxiXOjteRTX4Y"],"video":"https://www.youtube.com/embed/uQSWWj2DKok?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/cSZzZNRKrRUleb_c7BjvT9_5uJhPihkzaCUcbByVAKlWL0mxQdvu8JeTSjnHte8v4-8","contentRating":"Teen","contentRatingDescription":"Violence, Blood","adSupported":true,"released":"Dec 22, 2016","updated":1647535459000,"version":"1.181.88","recentChanges":"- v1.181.88 Very minor fixes and updates","comments":["The golden age of mobile games . Amazing visuals, easy goals to strive for, small micro transaction that you really don't need to help you progress in any way , no constant adds and if there is a add they reward you for watching with in-game currency to unlock more characters. It might be simple minded distance game but it's perfect and more mobile developers need to take notes","I love this! The upgraded weapon criteria. The animation redraws that feel just as charmingly nostalgic as the original. The only request I have is to add the option for the original song from the flash game to be an option to turn on. Like a Music Selection Button. The original song made me feel more like a space adventurer and I loved it. For old times sake, Gonzo. Please? Best wishes on every aspect of life, Kyra. (Agent K)","Very fun, has a huge number of creative unlockable characters besides the turtle, everything from a dolphin, a cat, a watermelon, and even a saiyan-like \"fruitian\". There are also good power-ups like the UI inspired super instinct. It has ads but they are built into the game in a way that doesn't ruin the experience.","You only watch the ads if you want to it's not forced. It only gets you skins for the character you play. This used to be an old flash game back in the day so it has nostalgia for me. Same thing and repetitive just make it a little further every time and get up grades not much skill needed but for a free game this has a lot going for it unlike others.","The game is addictive, the gore may not be for everyone but I think it's the best part! I keep shattering my highscores when I least expect it and thankfully it's not just another pay to win game, and once it starts to pick up you really make some cash and get the next best upgrade. A great way to pass the time, can't get the ad for 20 shells to work for some reason but I guess that's the best part, there's like no ads whatsoever!"],"appId":"com.gonzossm.sttt","url":"https://play.google.com/store/apps/details?id=com.gonzossm.sttt&hl=en&gl=us"},"com.pixio.google.mtd":{"title":"Summoner's Greed: Idle TD Hero","description":"You, the greatest and most powerful summoner, broke into the King’s castle and stole his priceless royal treasure! You gleefully take your loot back to your lair… But! The King has sounded the alarm and deployed his endless army of valiant heroes to bring it back! Grrr... It’s time to ready your defenses! They can’t steal your precious treasure.\n\nIn this idle TD game, you will strategically place your towers and cast powerful spells to defend against endless waves of the Kingdom’s mightiest heroes. Defend your ‘stolen’ (pshhh) loot against a variety of do-gooding heroes like the lowly peasant, the axe-wielding lumberjack, the ice mage and the King’s Elite Knight himself - you kinda don’t want to mess with him! \n\nSUMMON MONSTERS & MINIONS TO FIGHT THE KING’S ARMY!\nEarn magical orbs for defeating wave after wave of the King’s heroic army - use them to power your summoner’s portal to call forth a variety of monsters, creeps and minions to aid your defense! Recruit the common slimes, Slimey and Grimey - the super rare and absurdly cute hellhound Mocha - or Teddy, the EPIC teddy bear with superhuman strength! With dozens of creatures to call to your defense, do you have what it takes to defend against the heroes of the Kingdom? \n\n\nCAST POWERFUL SPELLS. OBLITERATE THOSE WHO DARE TO ATTACK YOU\nSo… Is the King stupid or something? He seems to have forgotten that you can shoot fireballs from your hands! Hello? Torpedoes of FIRE? In addition to your misfit army of monsters, you can cast powerful spells to bring death from above to your enemies. Use fireballs, lightning, ice and more to power up your monsters, rebuild defenses or defend your lair against the King’s army. Radical! \n\n----------------------------------------------------------\nSUMMONER’S GREED – HIGHLIGHTS\n----------------------------------------------------------\n• Dozens of monsters and towers to summon\n• Defend against endless waves of heroes and bosses\n• Each monster has their own unique abilities and secondary powers\n• Upgrade your towers to increase their effectiveness\n• Collect common, rare, epic and legendary monsters\n• Defeat a variety of enemy heroes, each with their own unique skills\n• Strategically place your towers to cause maximum damage\n• Use & upgrade spells to destroy, rebuild defences and buff your minions\n• Original graphics & unique gameplay for a totally new kind of TD experience\n\nSUMMON. DEFEND. DESTROY. DOWNLOAD SUMMONER’S GREED TODAY!\n\n\nSupport\nAre you having problems? Email us at Support@pixio.co or contact us in game by going to Settings> Email Us\n\nPrivacy Policy:\nhttp://www.pixio.co/file/PixioPrivacyPolicy.pdf\n\nFacebook: https://www.facebook.com/summonersgreed/\nInstagram: https://www.instagram.com/summoners.greed/\nTwitter: https://twitter.com/summonersgreed/\nYoutube: https://www.youtube.com/c/SummonersGreedOfficialYoutubeChannel\nJoin our Facebook Community Group: https://www.facebook.com/groups/718972438720238/","descriptionHTML":"You, the greatest and most powerful summoner, broke into the King’s castle and stole his priceless royal treasure! You gleefully take your loot back to your lair… But! The King has sounded the alarm and deployed his endless army of valiant heroes to bring it back! Grrr... It’s time to ready your defenses! They can’t steal your precious treasure.<br><br>In this idle TD game, you will strategically place your towers and cast powerful spells to defend against endless waves of the Kingdom’s mightiest heroes. Defend your ‘stolen’ (pshhh) loot against a variety of do-gooding heroes like the lowly peasant, the axe-wielding lumberjack, the ice mage and the King’s Elite Knight himself - you kinda don’t want to mess with <i>him</i>! <br><br><b>SUMMON MONSTERS &amp; MINIONS TO FIGHT THE KING’S ARMY!</b><br>Earn magical orbs for defeating wave after wave of the King’s heroic army - use them to power your summoner’s portal to call forth a variety of monsters, creeps and minions to aid your defense! Recruit the common slimes, Slimey and Grimey - the super rare and absurdly cute hellhound Mocha - or Teddy, the EPIC teddy bear with superhuman strength! With dozens of creatures to call to your defense, do you have what it takes to defend against the heroes of the Kingdom? <br><br><br><b>CAST POWERFUL SPELLS. OBLITERATE THOSE WHO DARE TO ATTACK YOU</b><br>So… Is the King stupid or something? He seems to have forgotten that you can shoot fireballs from your hands! Hello? Torpedoes of FIRE? In addition to your misfit army of monsters, you can cast powerful spells to bring death from above to your enemies. Use fireballs, lightning, ice and more to power up your monsters, rebuild defenses or defend your lair against the King’s army. Radical! <br><br>----------------------------------------------------------<br><b>SUMMONER’S GREED – HIGHLIGHTS</b><br>----------------------------------------------------------<br>• Dozens of monsters and towers to summon<br>• Defend against endless waves of heroes and bosses<br>• Each monster has their own unique abilities and secondary powers<br>• Upgrade your towers to increase their effectiveness<br>• Collect common, rare, epic and legendary monsters<br>• Defeat a variety of enemy heroes, each with their own unique skills<br>• Strategically place your towers to cause maximum damage<br>• Use &amp; upgrade spells to destroy, rebuild defences and buff your minions<br>• Original graphics &amp; unique gameplay for a totally new kind of TD experience<br><br><b>SUMMON. DEFEND. DESTROY. DOWNLOAD SUMMONER’S GREED TODAY!</b><br><br><br>Support<br>Are you having problems? Email us at Support@pixio.co or contact us in game by going to Settings&gt; Email Us<br><br>Privacy Policy:<br>http://www.pixio.co/file/PixioPrivacyPolicy.pdf<br><br>Facebook: https://www.facebook.com/summonersgreed/<br>Instagram: https://www.instagram.com/summoners.greed/<br>Twitter: https://twitter.com/summonersgreed/<br>Youtube: https://www.youtube.com/c/SummonersGreedOfficialYoutubeChannel<br>Join our Facebook Community Group: https://www.facebook.com/groups/718972438720238/","summary":"Summon &amp; defend your empire against kingdom heroes in this idle TD tower defense","installs":"10,000,000+","minInstalls":10000000,"maxInstalls":13771306,"score":4.779583,"scoreText":"4.8","ratings":613337,"reviews":22009,"histogram":{"1":13076,"2":6136,"3":12578,"4":39250,"5":542264},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $99.99 per item","androidVersion":"4.4","androidVersionText":"4.4","developer":"PIXIO","developerId":"9097044332653942940","developerEmail":"support@pixio.co","developerWebsite":"http://www.pixio.co/app-ads.txt","developerAddress":"Rm 2004, 20/F, Perfect Industrial Building,\n31 Tai Yau Street, San Po Kong, Kowloon","privacyPolicy":"https://docs.google.com/document/d/15Kw0JDNZI5QJNZriRVEk1AiLyU2hC83u3Onf8VuCROg/edit?usp=sharing","developerInternalID":"9097044332653942940","genre":"Strategy","genreId":"GAME_STRATEGY","icon":"https://play-lh.googleusercontent.com/cmkp7iL8wYgVNOJ0em3dj2qGrrhFAPEKFkONrNihPzKVE2eAuqUCkn4A-Ov-s5797-xZ","headerImage":"https://play-lh.googleusercontent.com/Jf7UsTcrZ2ej9E0NhqZ5nd1asrOa0Z-pTq1rwY-_4yrkK-hqLjBS802lsttXgziirrw","screenshots":["https://play-lh.googleusercontent.com/2nsOj7ybICC8mkSObTPkEcJ13JR_FFVw9TZBQUKSwtUKG8dPybgDjVxV4wfH4BISN-Y","https://play-lh.googleusercontent.com/UOsWEX5yNmTR77sDhQMy3eRjeFjvKZyj5Z8IM8F6KPjU13w92atiVkxsoRMd85mP","https://play-lh.googleusercontent.com/-z6Qyd_AhswC1vQ8Anl8_GPFoOKmg4StGpON7Ocbgy6SYScX05Of8wSwk5aKVpDW4Q","https://play-lh.googleusercontent.com/tgkb6lXnsVfM3ZX1mdFFnwM4N4ImpXpGeTnlV5GFmaSyftwsaVrHJ1bn9R96Ec-aQQ","https://play-lh.googleusercontent.com/ZkpejVBUDzhlngsHx-HTaKR8J5-a6SpUOgXE2_TBe0OM31khfPLl2UB54xNwdNzEWg","https://play-lh.googleusercontent.com/qLY7YqjAJkrgzTdRHTwvKJ6jIJ3D4G8cqb6l8sVhM1FdkPD9Jztl53fVUCqzBhAA","https://play-lh.googleusercontent.com/RHBhoF_h7QUPFZTnc0L6Z-Jgg6DoiYbsCR1SOZ1jtbIlzlpSMNNL60dULI5-F3jsc-g","https://play-lh.googleusercontent.com/z2sQXh7i8hPIvMQ2mUc_xL6EPXWwrdw02b2bRh9lhNwHIs6k2VOcTscwnfvBeLJ6IKj-","https://play-lh.googleusercontent.com/Uio8dW8t4VkKn6k23emQwYHB66_E1_0tOhs_XfZKT5UVNKVxFWoT_Zfmgp7d108TJg","https://play-lh.googleusercontent.com/c-K7B3QtdQUiRwL1Jk4EiKREtHn1lwhAgYydBImKxUNuPWfGa7zeqStgd7kDnG1aGQ","https://play-lh.googleusercontent.com/ETvLk_Yv2LApllbjm6C3pQPQ-tHKYJLJ5QyPfKic6X5AeLxn7M6txCMwZfNB1-OdL0A","https://play-lh.googleusercontent.com/4ZMViEO1imu1QTDDxGDOO1CnitSil-WFIkDYATnqQsO8RTlFSyP33pIwcaihbXMXkbYC","https://play-lh.googleusercontent.com/HnQsYrarpJl1gRluTKWoH9Xwl6zwv2gVhdAnrLQIN8pz4sX9rNHCAslGQ2Ld0PkKsH-q","https://play-lh.googleusercontent.com/0ymY_GJaXmFy170OSJDAiYtYrbKNaj8NW8nW0yOM4Dwil11GRpufo7EDO3HkT6YIjg","https://play-lh.googleusercontent.com/2O1bEbNKjyKE9oVdehnRTFJgkmSFzXQskvIabotQu8sh65XJEKLX7aoZrZ0pberuIFcl","https://play-lh.googleusercontent.com/63z0PlO58kBjcDnaR8j60m2rVuRzn4NUDsoswN-d2j6CRXA5Tq_RB07ziJeLHhYoOg","https://play-lh.googleusercontent.com/oYK3WbNrhpreeBj6kf6T3j7WF4MmTxiOsWhuYiJWDHwJOqJpIlPaMwpXrlTM1jJmuwE","https://play-lh.googleusercontent.com/8k2jyQB9ffUjitrZAZqNjei-ToViuraJO8g0qIflTtxYx7ruOJTDCGlCCu1imyQL2Q"],"video":"https://www.youtube.com/embed/5jdaIm-Rf9c?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/Jf7UsTcrZ2ej9E0NhqZ5nd1asrOa0Z-pTq1rwY-_4yrkK-hqLjBS802lsttXgziirrw","contentRating":"Everyone 10+","contentRatingDescription":"Fantasy Violence, Mild Blood","adSupported":true,"released":"Sep 19, 2017","updated":1661504182000,"version":"1.48.0","recentChanges":"What&#39;s up, my fellow Summoners? Evolve your Lightning Monsters to their FULLEST potential: <br>1) Puffy to Puffsaurus<br>2) Sparky to Zipzappy (The Zoomer)<br>3) Lightning to Megawatt<br>4) Pony Sparks to Rapid Thunder<br>5) Archangel Amael to Fallen Angel Amael<br>Come play Summoner&#39;s Greed for some faster-than-light updates!","comments":["So I'll start off by saying I typically don't play mobile games. But after seeing the funny meme-y ads, I gave this game a shot. So far, it's been really fun. Everything about this game just seems like smart mobile game design. Instead of playing ads after each wave or whatever, it gives you the choice to get rewards by watching ads. After losing a wave, you can either replay it or start over but you keep your summons' levels and can relocate them. Kudos to the developer. I'm impressed.","First of all, The ads for this game are adorable and finally broke me into downloading and playing it. So it's an adorable little tower defense that lets you build up over the course of several playthroughs of the waves. Lose on wave 10, start over and move your units that you summon around. Or you can try again with a buff and see if that's enough to push through. I'm enjoying it :)","Pretty fun so far! Edit: with probably more than 20 hours into this game, I have nothing but good things to say. It's a fun \"tower defense\" game, with ample rewards through your progress. The game can get tough, but you're allowed to try again or back up some rounds. The ads are always optional, but do tend to be short and with a nice reward, so I rarely turn one down. 5 ⭐ / 5 ⭐ Great Game! Edit: I spent many hours on this game, and now I'm back. I'm hoping I'll get Monitor's rewards!","It's a fun game when you have the time to spare, I've always loved tower defense's. The cute simple art style is great, in the future once I've played more I hope to see creatures with just a (little) more design details but not a complaint. It's fun, thanks for making the ads for the game funny and honest, it did the trick. Lol","I decided to give this a try because the ads for it were pretty funny. All in all, it's a nice little tower defense game, but that's really about it. I think it would be better if wave progression continued even when you don't have the game open, and it notified you when you hit a wall, so to speak. Also, evolution items seem to be cash-only. Never a good idea. Maybe they're offered once you clear a certain number of waves, but that goes back to the game not progressing unless you have it open"],"appId":"com.pixio.google.mtd","url":"https://play.google.com/store/apps/details?id=com.pixio.google.mtd&hl=en&gl=us"},"com.Wind.wings.Space.Shooter":{"title":"WindWings: Space Shooter","description":"▶ FANTASY STORY\n       The game is developed based on a fantasy story about a soldier who accidentally went through a time gap to the future. In the future, people have developed to an advanced level of science and technology and began searching for distant planets in space. They created many modern and powerful warships to fulfill that dream. The soldier once again joins the army to join the journey to find the promise land and their fleet encounters many warlike monsters in space. They not only attacked spaceships but also headed straight to invade the earth. In the face of that tense situation, the commander ordered the soldier to come to fight against enemy’s attacks. A real war has begun. You will play the soldier who takes control of the entire spaceship, protects the earth and leads other spaceships. Destroy and break the enemy's plans.\n         WindWings: Space Shooter, Galaxy Attack is a shoot’em up game genre with many new and modern improvements with lots of impressive points.\n        ▶ NEW FUTURE\n\t• Players will bring two types of spaceships into battle, each has a unique property. Players will use suitable spaceships from time to time.\n\t• Many types of monsters are sophisticatedly designed with different types of attacks.\n\t• Many rounds are constantly updated with many different challenges for players to experience.\n\t• Many warships, each has a different design and use of a different type of ammunition. Players can optionally customize and combine. \n\t• Besides the main spaceship, there are 2 assistants to increase the combat ability.\n\t• Upgrade your attack power, spaceship speed with Laser missiles, mega-boms and magnets.\n•\tThe game has a good balance of difficulty, suitable for both beginners and hardcore gamers.\n\t• Many support equipments to help spaceship increase combat ability.\n\t• Diverse tasks and attractive rewards\n\t• Diversify the map from the earth to remote places in the universe.\n\t• Images and sounds combined harmoniously will give players a great experience.\n        ▶ HOW TO PLAY\n\t• Touch the screen and move to avoid enemy’s attacks, shoot back and destroy them.\n\t• Click to change the spaceship in accordance with each type of enemy.\n\t• Collect bullets and equipments to upgrade the spaceship.\n\t• Use support features during an emergency or when facing strong enemies.","descriptionHTML":"▶ FANTASY STORY<br>       The game is developed based on a fantasy story about a soldier who accidentally went through a time gap to the future. In the future, people have developed to an advanced level of science and technology and began searching for distant planets in space. They created many modern and powerful warships to fulfill that dream. The soldier once again joins the army to join the journey to find the promise land and their fleet encounters many warlike monsters in space. They not only attacked spaceships but also headed straight to invade the earth. In the face of that tense situation, the commander ordered the soldier to come to fight against enemy’s attacks. A real war has begun. You will play the soldier who takes control of the entire spaceship, protects the earth and leads other spaceships. Destroy and break the enemy&#39;s plans.<br>         WindWings: Space Shooter, Galaxy Attack is a shoot’em up game genre with many new and modern improvements with lots of impressive points.<br>        ▶ NEW FUTURE<br>\t• Players will bring two types of spaceships into battle, each has a unique property. Players will use suitable spaceships from time to time.<br>\t• Many types of monsters are sophisticatedly designed with different types of attacks.<br>\t• Many rounds are constantly updated with many different challenges for players to experience.<br>\t• Many warships, each has a different design and use of a different type of ammunition. Players can optionally customize and combine. <br>\t• Besides the main spaceship, there are 2 assistants to increase the combat ability.<br>\t• Upgrade your attack power, spaceship speed with Laser missiles, mega-boms and magnets.<br>•\tThe game has a good balance of difficulty, suitable for both beginners and hardcore gamers.<br>\t• Many support equipments to help spaceship increase combat ability.<br>\t• Diverse tasks and attractive rewards<br>\t• Diversify the map from the earth to remote places in the universe.<br>\t• Images and sounds combined harmoniously will give players a great experience.<br>        ▶ HOW TO PLAY<br>\t• Touch the screen and move to avoid enemy’s attacks, shoot back and destroy them.<br>\t• Click to change the spaceship in accordance with each type of enemy.<br>\t• Collect bullets and equipments to upgrade the spaceship.<br>\t• Use support features during an emergency or when facing strong enemies.","summary":"Gather forces to rescue the galaxy from the invasion of space invaders.","installs":"5,000,000+","minInstalls":5000000,"maxInstalls":5056686,"score":4.8022923,"scoreText":"4.8","ratings":47547,"reviews":2548,"histogram":{"1":881,"2":402,"3":1085,"4":2451,"5":42704},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $99.99 per item","androidVersion":"4.4","androidVersionText":"4.4","developer":"GCenter","developerId":"6177492284961668428","developerEmail":"hoasinh01@gmail.com","developerWebsite":"http://gcenterstudio.com","developerAddress":"Thanh Cong, Ba Dinh, HaNoi","privacyPolicy":"https://gcenter-com.webnode.vn/privacy-policy/","developerInternalID":"6177492284961668428","genre":"Arcade","genreId":"GAME_ARCADE","icon":"https://play-lh.googleusercontent.com/1hUbSRARaUzgP7cQFa0HzX6LL4RmDUSzMk9ao5pl7w3m89wlm11QTDh4t2EAOhM1ufJm","headerImage":"https://play-lh.googleusercontent.com/e3a1iLgtPjb5SWVdoz3yiisrqTRq4gxdrYLwDVPk-dTX4WiT3eVququoZoMBMPZa1xrk","screenshots":["https://play-lh.googleusercontent.com/MlLCNCgSaaV3yy1ygp2MEKsq1ePC2NeNG4oipce7ipOiCc2HxHUziNqSm_IICTdXoto8","https://play-lh.googleusercontent.com/FTivw8cWL-SLEbo2lBO1EuuukelM6T8DYQgu3m94lhSfNHocGuSC7eTZAc0puy7A4Q","https://play-lh.googleusercontent.com/SWeylj8FOH21S_7c70TUaqmNQwHTD8HwcrIzJR0t3wsfVIb2P2sGx5fe6NMYqFe1r50A","https://play-lh.googleusercontent.com/NCgwioaDY-JuMRe9NiOl4OazyBoqRq2iZso7jgpY-1U4Tzou8N2hxLXefPanMEcTQQ","https://play-lh.googleusercontent.com/824TmmMtjB4JPZcg4yDTsmeCR3kPemNtSzmvipQ8m9zG5iD2Q7wckDl4m-v0AHnZjZM","https://play-lh.googleusercontent.com/hGMu48ILrv41oyO0RhOK3F3QK0-mUXiDBdgUUBcNw8k16h62ITZK7HqI5o7-ZkbKdG8","https://play-lh.googleusercontent.com/C5k6I2Lhw2Sn0n36p_34wvKQspRTf4pscb19WYzGhxK5pHyhXqqPE5iwZX8KxEhgNpy7","https://play-lh.googleusercontent.com/xy1UmWbOXzYihctR7weNH86ywQULejyKLU-MDlENm7ieqJvAoovtzgrxy2-ebVfh7AU","https://play-lh.googleusercontent.com/dKlYxe6Wdj2zI4_k8CaK8SuZJv3DRyN7DLkxQIqeutvJ5uD33ANon6FTky85-vvO97w","https://play-lh.googleusercontent.com/OPuFQfHc9nYZIKoZf43EFfpXBNS5ZcfnXTO0Yfb9KtOfwMkca2OQ54bsmeHt66DrN-U","https://play-lh.googleusercontent.com/MegOnmyAP5RF-2rkfCPKLviRZSnZv5LPr1u2aQ1bbxu706gMtoM_wpe9v-sG2uhjLu4","https://play-lh.googleusercontent.com/wHOk06H1vN3P3TecvLHht5Wm_ogMVPfIt2C3xWcxdSujLtlm4Y0a4OOwYzWkR_VK4g","https://play-lh.googleusercontent.com/S2OwXK2uiS9K0oXVhRhjDMcUaGt0-tipgl4IH4ypiLZKItIcM2PiArn78VhnetJPExDC","https://play-lh.googleusercontent.com/-g-GLFQ4MiN7jn7pVegBNwY4m2TiE945JfBSltxHbdz214sOyAbcjfQXMf3euhwDwA","https://play-lh.googleusercontent.com/Zcf5WBmkQmC20708cOkbbwc6f5R6Z5KFE5CMpWFkQ85WWrqvL9GS-ZGO9XHx2mou2w","https://play-lh.googleusercontent.com/1T0FxDTivfVa0gm61k7PyaYrTjtwKbpIVutphtymS5E7VDx5J0O_rSYpEuD-18iZvw","https://play-lh.googleusercontent.com/h7PgtfzJt83SOgF2BWPWk65i65BVqUynfqcGvLhSESZwh-tUNasAPcEpReueMFNpsw","https://play-lh.googleusercontent.com/hmzCv_UPdlmMo_xuSTagGNLD_MdMemlyU4P1lqX1aHLMW1566mUFHYGPrRvscHc38Q","https://play-lh.googleusercontent.com/GS0wvfxZIvtnmHv1koUfWv0U67wOqUgPZMQEic3SWMTxS7MchlC8g1N2JkyvKvEA3Eg","https://play-lh.googleusercontent.com/8iEHtJuGnjHAfA8bZyAAPCyb5bs0JGBJvXTTW-TQrSbJx_9Rspg6LkOv1l4EpSGyKqA","https://play-lh.googleusercontent.com/eKDOoRHcAzgCqXP4KNWuO3mliOtZmgTDOfKqwRtxhCYJKPQyWRdfyIc0qQjaATZ3dg","https://play-lh.googleusercontent.com/TTeYOaoMnbSKo_OIkDQfB5WVj66FFHJcR2LSg0YErNfaNfYj8XfO970X0LAEshFqG9Q","https://play-lh.googleusercontent.com/qdzxTRbMYwweeCTLNh9zB6brH8-UId7h2Sw-5aqwCMsQ7Q0elcjusabxCwI9IHbiPzU","https://play-lh.googleusercontent.com/3wTJcQopbGV3Ei3jp27WSHijZRnnNiLGq7cf2sEnpK9NNK4tEqPjcKu45r4z_f3r3J1a"],"video":"https://www.youtube.com/embed/-ZRYMWk9lO8?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/e3a1iLgtPjb5SWVdoz3yiisrqTRq4gxdrYLwDVPk-dTX4WiT3eVququoZoMBMPZa1xrk","contentRating":"Everyone 10+","contentRatingDescription":"Fantasy Violence","adSupported":true,"released":"Jan 18, 2020","updated":1658893895000,"version":"1.3.61","comments":["I like it so far. A simple space shooter with easy controls and great colors and graphics. Pretty easy to upgrade because coins, rewards and such are in abundance. I love the slow down option because in games like this you just can't get outta the way sometimes. It's a game you'll wanna play all the way through barring any unknown surprise you gotta pay to win. But right now I like it. 5 stars.","Easy to pick up and put down. Paying the $20 for the premium version is well worth it. There are only one reason for not giving this game 5 stars, and that is the Fusion system. In the game, you get item upgrades for your ships, but it is controlled by a random generator, in addition to the ratios being poorly skewed. It makes going for (and therefore, investing in) fusing items relatively pointless. With the exception of that setup, this game is easily one of best time-killers I have played.","Excellent! Graphics are good, the game is fun. Gets tougher as you go, but not so quickly that I just get frustrated because it's \"impossible\" to win. I might have to restart several times, but not so often that I just quit playing. Actually, it's addictive once you start. The one negative is: programmers need to give SOME instruction on upgrading the ships, having multiple ships in play, the drones, and other equipment available for use. I've had to trial and error figure out these things.","Recent update introduced incessant pop up ads that cannot be skipped. The dev response makes no sense. The use of a free game is a deal between the developer and the user. The user watches some ads in exchange for some value: either just the gameplay itself or an in-game item. If you change the amount of ads the user must watch to access the same value in the game, you changed the deal for the worse. I don't object to seeing ads. I object to being bombarded with them with no added value.","Best arcade space shooter. All the other's don't compare. Graphics are great. Game play is pretty fair it's good for beginners as well as experts. Multiple ways to upgrade the spaceships. They obviously took there time creating the game, instead of just throwing it together for some fast $$$. If you pay for the premium version you don't have to watch any ads. That might be the best part of the whole game. Hat's off to the creators good job."],"appId":"com.Wind.wings.Space.Shooter","url":"https://play.google.com/store/apps/details?id=com.Wind.wings.Space.Shooter&hl=en&gl=us"},"com.Gcenter.DefenselegendX.TowerDefense.TD":{"title":"Defense Legend 4: Sci-Fi TD","description":"Being the next part of the series Games Defense Legend, Defense Legend 4 gives Players full of new interesting experiences. In this part, our defense system has had a great development and modern equipment meanwhile the Dark Force also has come back strongly and cruelly.\n- BRIFT STORY:\n             In this part, the war between the Human and the Dark moved to a fierce new phase. In previous parts, Human found out the way to stop and defeat The Dark’s attacks. However, the Dark having cunning schemes always changes and develops after each of their failures. Battle in Defense Legend 4 is a maximum challenge for the followers of Defense Legend.\n             The Dark will send a large and powerful army to attack fully to our strategic bases. They attack from all sides from the air, land and underground… Besides extremely modern weapons, the Dark also uses magic enhancing their strength to destroy Human’ bases.\n- FUNCTIONS:\n             Defense Legend 4 requests players to focus highly and give good strategies to defeat the Dark’s troops\n        ★ Two heroes fight directly. Players are supported fully from the superhero team equipped more modernly. \n        ★ Upgrade strongly cannons, develop special skills.\n        ★ Various territories such as deserts and forests and iced lands. Each kind of territories gives different challenges.\n        ★ Various strategies such as air forces, land and underground…\n        ★ A lot of modes\n\n---------------------------------------\nContact us for further support and information:\n- Official Fanpage: https://www.facebook.com/Defense.Legend.X\n- Official Group: https://www.facebook.com/groups/218680696589686","descriptionHTML":"Being the next part of the series Games Defense Legend, Defense Legend 4 gives Players full of new interesting experiences. In this part, our defense system has had a great development and modern equipment meanwhile the Dark Force also has come back strongly and cruelly.<br>- BRIFT STORY:<br>             In this part, the war between the Human and the Dark moved to a fierce new phase. In previous parts, Human found out the way to stop and defeat The Dark’s attacks. However, the Dark having cunning schemes always changes and develops after each of their failures. Battle in Defense Legend 4 is a maximum challenge for the followers of Defense Legend.<br>             The Dark will send a large and powerful army to attack fully to our strategic bases. They attack from all sides from the air, land and underground… Besides extremely modern weapons, the Dark also uses magic enhancing their strength to destroy Human’ bases.<br>- FUNCTIONS:<br>             Defense Legend 4 requests players to focus highly and give good strategies to defeat the Dark’s troops<br>        ★ Two heroes fight directly. Players are supported fully from the superhero team equipped more modernly. <br>        ★ Upgrade strongly cannons, develop special skills.<br>        ★ Various territories such as deserts and forests and iced lands. Each kind of territories gives different challenges.<br>        ★ Various strategies such as air forces, land and underground…<br>        ★ A lot of modes<br><br>---------------------------------------<br>Contact us for further support and information:<br>- Official Fanpage: https://www.facebook.com/Defense.Legend.X<br>- Official Group: https://www.facebook.com/groups/218680696589686","summary":"Protect the world against the invasion of the Dark Force.","installs":"1,000,000+","minInstalls":1000000,"maxInstalls":1498955,"score":4.662393,"scoreText":"4.7","ratings":20828,"reviews":637,"histogram":{"1":1064,"2":259,"3":438,"4":1064,"5":17975},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $89.99 per item","androidVersion":"4.4","androidVersionText":"4.4","developer":"GCenter","developerId":"6177492284961668428","developerEmail":"doanhtu.gcenter@gmail.com","developerWebsite":"http://gcenterstudio.com/","developerAddress":"Thanh Cong, Ba Dinh, HaNoi","privacyPolicy":"https://gcenter-com.webnode.vn/privacy-policy/","developerInternalID":"6177492284961668428","genre":"Strategy","genreId":"GAME_STRATEGY","icon":"https://play-lh.googleusercontent.com/S7_O7_1uyoCPax5oj8w_i1hHs3gfybnEZLNHED0eJO2KXphJmEYwkG7RyTA9ZB69MOQ","headerImage":"https://play-lh.googleusercontent.com/LArGULT40nYpg2QNeDjMqirJID_Iz7RcXGR0OUr0bvVR8wvW-ypMWgLf50UJHMRzw-k","screenshots":["https://play-lh.googleusercontent.com/6ki5z1xGFGSvG3DPoqnUKzBc5j4uJ3FAbPZP7jwdwlwEWeCf-oIvVXpTRds5YicBheQ","https://play-lh.googleusercontent.com/7Ceye4a2clyk77HcDxeAgQU7Q672Hmj9HFInvqt2rNI3ldGxqBayCLKOC0B2I63E6EA","https://play-lh.googleusercontent.com/AK4kmc2NOYtYEz9n4V4IMAe-r3KGe_2heF4FMelCHpGPQst_Y2szwm6wWAIDIqRJ3A","https://play-lh.googleusercontent.com/TSePx0z_avrxADbwYctepbn_s6tD2uprCxZLrdicEn4pBvrSkgamUkpIDg6jRa0kPpo","https://play-lh.googleusercontent.com/YYUwap6m06nbxz_wYVvrWbCnLHDv_JJSbZUcnfUKCvEr0oFVU_6ibmcX75YA6eKjI5TL","https://play-lh.googleusercontent.com/Z_jHFnAwVPLP3g4ATfblVXKNee1aDwB1Fq1GqpsJ54kulShU8HKawlxWDmTxp8XPK3c","https://play-lh.googleusercontent.com/rrhm63qRLgQdkOTA966CW0MyTx24WpFNLmVre3FSDB7DY16biK1eVqfBOaELNilRemOW","https://play-lh.googleusercontent.com/fhDtDWJ7Y6IP1GqD1G5pvkzrnz-gau_K_LWQ7DxLWV9gPP8OBlzxPkNkxnjs7T37Wg","https://play-lh.googleusercontent.com/0h-cvcGoHZXitzZZDqbN4TWVj5bs1KPNAnfGnZzEyscz95nIIeeQjDF3LDG6bZuQxQ","https://play-lh.googleusercontent.com/npSUH4eRy3S8Uavy2TzAJmPvJZpaao0YElL1SFD8BhSpu4GhwwjM1XwvIsziOx9JrRw","https://play-lh.googleusercontent.com/RekI4j43Jp24IyVgG4349F1Dqm_MTtF9DTMwpGmBbYXLo2Vbw2yNE0S04TcYngK8WCE","https://play-lh.googleusercontent.com/wJs3tlyTzN3ntFeY8uUm1p6vIOZdVLmXtVIcuV1L0IJ2M5l_YKOz_n1Upz2bXXFMkQ","https://play-lh.googleusercontent.com/CiZyUf4CArCWYpci9SrrqgemFgSPnJVbgkXUlX5iT8kyd_epyTgbhr62O8zPv79X8g","https://play-lh.googleusercontent.com/TYSPRLgGKxngKt9lSUrO8dchVR-h75IEhSnPylpp7PTBcQ0O4kTTV0anMjf_whpy8A","https://play-lh.googleusercontent.com/r69NR23gbKaTiTvOUXrjC6KWKVLlWeTW_KNNTqWjordWHCDC4vYR9Dk3st2TW8Qu6NI","https://play-lh.googleusercontent.com/GsEQrOckJHa-gLsl-OAjUbomcfrOZ6whFssh436_iltj1QS1O8EaM0X2pLAZBRzBRg","https://play-lh.googleusercontent.com/ytFC4x-ZFwXMFvuwJZ_KunXZhsL39Orz2-W6ITXjwJj0MR9XoL1BREUWRw10eAHdPuE","https://play-lh.googleusercontent.com/AdgZOMLmA65l7t-QoQFNnM7-fJoBQMAt91N8aRpkwopo3d-x7JqwQrlAmBsW9s7inPfY","https://play-lh.googleusercontent.com/GDeDQ-rrCfBni0p0UIUScW2dF2Ovebzor_XcqgEVn64yA0Q_f7EoMwcE3H596I-qCEE","https://play-lh.googleusercontent.com/szJEAHfFVdTSmr9TtQp5abxt4Y1DMjoJqxPwhd5QZxGC5jwilwyOPasl-DotXu41b27b","https://play-lh.googleusercontent.com/oFxLAmsHRjy4mZTYfS7S0Rj-pifa9Hifm5V2amPfOpUFb4MRfSSOPwCRwzL5x6Os-rk"],"video":"https://www.youtube.com/embed/5BbWSjQGrz8?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/LArGULT40nYpg2QNeDjMqirJID_Iz7RcXGR0OUr0bvVR8wvW-ypMWgLf50UJHMRzw-k","contentRating":"Everyone 10+","contentRatingDescription":"Fantasy Violence","adSupported":true,"released":"Jul 24, 2021","updated":1661400852000,"version":"1.0.66","comments":["Can only see 2/3 the screen at once, can't scroll if you're trying to place a tower, and no benefit for calling waves early, except for occasional tactical considerations. Tower descriptions are often confusing (lightning tower \"attaches bullets\" to enemies?) or stupid (\"slowly gun\") or look like code. Things that you may like or dislike: hardest difficulty level is still easier than most game's normal mode, towers can be destroyed, and you can only put towers in predefined locations","Like it so far. Not the easiest but a good challenge. Have to figure some stuff out on your own because it doesn't really tell you much. Biggest complaint is that towers can be damaged/destroyed. You can't see all the field at once so you scroll down to place something, scroll back up and you've lost a tower! It would be nice to put towers wherever you want instead of premarked locations also. Other than that, great graphics and fun to play.","Too much over there too graphics where you can't even tell what effect your choices are having. If you like being entertained not than engaged, you might like it more than I did. I like a clean game where I can calculate my choices and try out. The graphics in this game is pretty but make it chaotic and you can't really keep track of things.","Unfinished game. There are lots of things that simply not completed. 1. The Report Bug doesn't have a To email. 2. The menu red dots are inconstant. 3. There are Towers that don't have descriptions. Update: I would give it 0 starts. Starting at level 40, you have to complete ALL previous levels at ALL difficulties with PERFECT scores! Really?","How do these broken GD games get such high ratings? Don't trust anyone that has to cheat and pad their own ratings. This is so broken its nearly unplayable. By the 2nd level, much of the playing field is off the screen and you can't see the battle or place defense in all places. The screen won't move or adjust so you just see your defense firing into oblivion but don't fully see what's going on. It's clunky and not smooth mechanics. It's not terrible, but it's definitely nowhere near 4.9 stars."],"appId":"com.Gcenter.DefenselegendX.TowerDefense.TD","url":"https://play.google.com/store/apps/details?id=com.Gcenter.DefenselegendX.TowerDefense.TD&hl=en&gl=us"},"com.alexanderwinn.landfall":{"title":"TerraGenesis: Landfall","description":"From the makers of TerraGenesis comes TERRAGENESIS: OPERATION LANDFALL - a city building simulator in which you can build, design, and manage your own city in space. Bring life to another world and pave the way for a new future for mankind. The first human civilization in space is in your hands: lead and help your cities thrive in this city-building simulation. Expand your city with new buildings and level up your society, design facilities, manage resources, and keep your residents happy and healthy.\n\nCREATE LIFE AND BUILD A NEW WORLD FOR HUMANITY\nCreate and build a new society in space as you lead the way for a new future for civilization in this city-building simulation. Cultivating and managing water, oxygen, and food resources beyond Earth is the next step in human evolution. Explore, create, survive, and expand cities across the universe using real NASA science. Expand your culture and capabilities to exceed your dreams on barren planets!\n\n- Free city-building simulation: balance resource production based on the needs of your growing community!\n- Spread life throughout the universe - transform Mars and other barren planets into modern, thriving civilizations in this city-building simulator.\n- Create and adapt strategies to support life in space - supply oxygen, water, and food to your citizens!\n- Explore, build, and conquer new territories in outer space: the universe is constantly evolving—and you are part of it!\n\nEXPLORE NEW PLANETS—BRING LIFE AND DEVELOP CIVILIZATION IN SPACE\nBring life to different planets using the latest technology for construction and the production of resources. The future is all about survival and evolution in space. Create new-age buildings, and transform the planets of the galaxy. Evolve planets across the universe in this free city-building simulator!\n\nTAKE PART IN RANDOM EVENTS\nSpace demands new ways to survive as it is highly unpredictable. From building new cities to ensuring humanity's survival, TERRAGENESIS: OPERATION LANDFALL is a science-based city-building simulator—design and maintain sustainable growth in space. Build, manage, and rule your own city in outer space, and help human civilization thrive!\n\nCheck out our social media sites!\nInstagram: https://www.instagram.com/tg_op_landfall/\nTwitter: https://twitter.com/TG_Op_Landfall\nDiscord: https://discord.gg/jZ3729uE\nFacebook: https://www.facebook.com/TerraGenesisLandfall/","descriptionHTML":"From the makers of TerraGenesis comes TERRAGENESIS: OPERATION LANDFALL - a city building simulator in which you can build, design, and manage your own city in space. Bring life to another world and pave the way for a new future for mankind. The first human civilization in space is in your hands: lead and help your cities thrive in this city-building simulation. Expand your city with new buildings and level up your society, design facilities, manage resources, and keep your residents happy and healthy.<br><br>CREATE LIFE AND BUILD A NEW WORLD FOR HUMANITY<br>Create and build a new society in space as you lead the way for a new future for civilization in this city-building simulation. Cultivating and managing water, oxygen, and food resources beyond Earth is the next step in human evolution. Explore, create, survive, and expand cities across the universe using real NASA science. Expand your culture and capabilities to exceed your dreams on barren planets!<br><br>- Free city-building simulation: balance resource production based on the needs of your growing community!<br>- Spread life throughout the universe - transform Mars and other barren planets into modern, thriving civilizations in this city-building simulator.<br>- Create and adapt strategies to support life in space - supply oxygen, water, and food to your citizens!<br>- Explore, build, and conquer new territories in outer space: the universe is constantly evolving—and you are part of it!<br><br>EXPLORE NEW PLANETS—BRING LIFE AND DEVELOP CIVILIZATION IN SPACE<br>Bring life to different planets using the latest technology for construction and the production of resources. The future is all about survival and evolution in space. Create new-age buildings, and transform the planets of the galaxy. Evolve planets across the universe in this free city-building simulator!<br><br>TAKE PART IN RANDOM EVENTS<br>Space demands new ways to survive as it is highly unpredictable. From building new cities to ensuring humanity&#39;s survival, TERRAGENESIS: OPERATION LANDFALL is a science-based city-building simulator—design and maintain sustainable growth in space. Build, manage, and rule your own city in outer space, and help human civilization thrive!<br><br>Check out our social media sites!<br>Instagram: https://www.instagram.com/tg_op_landfall/<br>Twitter: https://twitter.com/TG_Op_Landfall<br>Discord: https://discord.gg/jZ3729uE<br>Facebook: https://www.facebook.com/TerraGenesisLandfall/","summary":"Bring life to another world and build human settlements in space","installs":"100,000+","minInstalls":100000,"maxInstalls":340844,"score":4.0054646,"scoreText":"4.0","ratings":12318,"reviews":878,"histogram":{"1":1140,"2":669,"3":1277,"4":3094,"5":6121},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.49 - $99.99 per item","androidVersion":"8.0","androidVersionText":"8.0","developer":"Tilting Point","developerId":"5479878731323183535","developerEmail":"support@edgeworksentertainment.com","developerWebsite":"https://www.tiltingpoint.com/","developerAddress":"521 5th Avenue\nNew York, NY 10175","privacyPolicy":"https://www.tiltingpoint.com/privacy-policy/","developerInternalID":"5479878731323183535","genre":"Simulation","genreId":"GAME_SIMULATION","icon":"https://play-lh.googleusercontent.com/u3KtFOMag_dBtLNtJ5DFt4b7QyeGWfgSr_hYGjH1jTTNuop8-IV0OvLlpbNmqRTiXykb","headerImage":"https://play-lh.googleusercontent.com/mTG0rC0GmzRoJ12-MqcFg_KHDDbodnTntHiSeDOAv2_g2dM2I4ahLketRZnvosbKVw","screenshots":["https://play-lh.googleusercontent.com/qroUvcFoNRyLVQzOvhYg3eBhhyMQYTnMj3XG6YBuujBfZsOcBGSWGOw3O6oG7P7Vmctm","https://play-lh.googleusercontent.com/mR3fKWbpSZDMBytwk5k0HaUwEjf71eXRIXa6VmzIlJ3JdYeaX_hbDXM6NLiUG-q55w","https://play-lh.googleusercontent.com/bSS3WHnCItsozf1x0XItqXRik66U7PCUr_ZV7eTN0-Y9zsp_70uxuwkn5Luy-aFc0gA","https://play-lh.googleusercontent.com/VSCtDDo8N-QYc1ryNy66epMFZMehi0ogmY2ObugGsJfLMZ_RmGInMmtyP0fAo8NSHTI","https://play-lh.googleusercontent.com/0a7PLFohvJcX3XVhQ0fHuredU1Vf18B4qvQQsyciCPjVh_iiKr7VmGSYQgEikQDK7tg","https://play-lh.googleusercontent.com/DucC9qZDP9N7QNaV8pC8wugLaaXHBopDn82eTIImvowNgE55DsG01g0qAqnjNKSuXg","https://play-lh.googleusercontent.com/TtJXwf7M8Ns8ksMb2USmjCiaenBzwnuIkVGjcflQGzyubrdaCj-FsDAnpVyVoDHc6L9v","https://play-lh.googleusercontent.com/wpm-k8wuIccOSD4JhgO7JsBqezFMflxdu5N-0F19xykUtcgsxMdnycj4evrcmRF5Yg","https://play-lh.googleusercontent.com/F0HwIITJ05fjwfHR4DsbZ81Z6j9af0C_us-wL4vx-awnehusQu29bsIIo9jsaAwdHpE","https://play-lh.googleusercontent.com/JEJoOT-W16MPQSk8hewO5v2ODGO1_kFQVzAqLoAa3LU2ibM0uuZCaZimZVWkrgs2yQ","https://play-lh.googleusercontent.com/W0puKI1nWTWgcMKP-78pZFlIqNg-rDzrx0zCEYqKsdkeO31-XBFKlyiHN30MeGyJgJo","https://play-lh.googleusercontent.com/wQBrC5hq0iudmA-0y9V3xXJBg82EuruKrNfcgLnVlAk2Gg_Sc75LWBfSLiIvGoMIsiA"],"video":"https://www.youtube.com/embed/9YDscIGknCk?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/mTG0rC0GmzRoJ12-MqcFg_KHDDbodnTntHiSeDOAv2_g2dM2I4ahLketRZnvosbKVw","contentRating":"Everyone","adSupported":true,"released":"Aug 9, 2022","updated":1661386432000,"version":"2.3","comments":["A nice spin from the original, but there are a few issues that could be addressed. The highest research tiers are a bit too expensive (mid-tier ones are fine). The free placement is nice, but a quick rotation button could help. Could use separate counts for settlers and visitors. Finally, depleted outposts should be dismantled, so the map doesn't fill with so many gray markers. The game is still new as of writing, so I hope to see improvements made. Overall, though, good and recommended.","This is an excellent and entertaining take on the original game, featuring many realistic scenarios, costs, and graphics. It truly breaks through the normalcy of city-building games and colonization. They have done a great job balancing both wait times and monetization; ads are completely optional, and for that I sincerely thank the developers. Suggestion-wise, I would love to see higher graphics, and perhaps an option to hide the repair alerts for the sake of visuals. Thank you!","Great game so far! The Mechanics work great and it's fun to play. However the frequency of critical events is in my opinion too high. I'm on the game for 5 minutes during which my batteries broke down, and engineer dies, disgruntled settlers steal a rover? Of all things, makes playing quite difficult, and seems. A little excessive. The zoom settings are sometimes hard to deal with. It would be nice if there was a slider option instead of 2 fixed zoom settings. Hope this helps. Keep it up!","Reduce stars 3 to 2... I'm stuck! I've finished the tutorial, have 80GP and now I'm stuck because it is telling me to build a command center.. I already have one! I can't move past it. I've tried to click the \"Settings\" wheel several times, but it's greyed out. All that needs to happen to for the \"Settings\" button to be enabled throughout the Tutorial. That way if someone wants to restart, they can.","This game is great, but it does have a few flaws that could be fixed. For example, the whole tutorial was pretty good but if you didn't finish it in one go, it would glitch. This would ultimately make it nigh impossible to complete said tutorial, and would require you too Uninstall to reinstall to fix this problem. After you do the tutorial, it is a great game. I love the dynamic of the game and it is not to hard to understand."],"appId":"com.alexanderwinn.landfall","url":"https://play.google.com/store/apps/details?id=com.alexanderwinn.landfall&hl=en&gl=us"},"com.armorgames.voidtyrant":{"title":"Void Tyrant","description":"Build a deck as you battle across the galaxy, gathering powerful cards along the way. With strategy and a bit of luck, you might be able to reclaim the Eyes of Chronos.\n\nA single-player adventure, play with 500+ cards and three unique classes to engineer a custom deck to your own design. Rooted in the simple hit-or-stand mechanics of blackjack, Void Tyrant is an easy to understand roguelike with engrossing depth. Battle quirky aliens, disarm traps, upgrade your spaceport, and face off with the sinister Wruut.\n\nNewcomers or seasoned veterans alike will enjoy deck building in Void Tyrant.\n\nFEATURES\n\n- Strategic deck building and card-based combat.\n- Four classes to choose from, each with its own strategy\n- Upgrade your town for new powers and adventures.\n- Collect blueprints and craft new ships with special abilities and cards\n- Powerful artifacts stuffed into shiny treasure chests.\n- Free with ads or convert to premium (NO ADS) with one purchase.\n- Traps, strange aliens, and lots of other surprises...","descriptionHTML":"Build a deck as you battle across the galaxy, gathering powerful cards along the way. With strategy and a bit of luck, you might be able to reclaim the Eyes of Chronos.<br><br>A single-player adventure, play with 500+ cards and three unique classes to engineer a custom deck to your own design. Rooted in the simple hit-or-stand mechanics of blackjack, Void Tyrant is an easy to understand roguelike with engrossing depth. Battle quirky aliens, disarm traps, upgrade your spaceport, and face off with the sinister Wruut.<br><br>Newcomers or seasoned veterans alike will enjoy deck building in Void Tyrant.<br><br>FEATURES<br><br>- Strategic deck building and card-based combat.<br>- Four classes to choose from, each with its own strategy<br>- Upgrade your town for new powers and adventures.<br>- Collect blueprints and craft new ships with special abilities and cards<br>- Powerful artifacts stuffed into shiny treasure chests.<br>- Free with ads or convert to premium (NO ADS) with one purchase.<br>- Traps, strange aliens, and lots of other surprises...","summary":"A single-player card adventure","installs":"1,000,000+","minInstalls":1000000,"maxInstalls":1037812,"score":4.109557,"scoreText":"4.1","ratings":29902,"reviews":3407,"histogram":{"1":3100,"2":1637,"3":2264,"4":4772,"5":18120},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $4.99 per item","androidVersion":"5.0","androidVersionText":"5.0","developer":"Armor Games","developerId":"6749058773626431687","developerEmail":"Support@ArmorGames.com","developerWebsite":"https://armorgamesstudios.com/games/void-tyrant/","developerAddress":"16808 Armstrong Ave\nIrvine CA 92606","privacyPolicy":"https://armorgamesstudios.com/privacy/","developerInternalID":"6749058773626431687","genre":"Card","genreId":"GAME_CARD","icon":"https://play-lh.googleusercontent.com/PCXprJspVFmASJcd1Jsm-ZXNxiEr7oSYuOxMnXNvfjOElnOh79jfET9f0701RZ14uQ","headerImage":"https://play-lh.googleusercontent.com/8_PIz0GG7bDHyfid2NzWkeEsvRQ5Q1Qd4YLE7AjQmZaEhzj6rxpJdUnCRtkJ72PsdBDm","screenshots":["https://play-lh.googleusercontent.com/movzZEm9cV__Aahc8LDXIDhcPk0_AyQsXgFfysnjOK0R7-sl4X6tc6YHxCellU0XFnc","https://play-lh.googleusercontent.com/mjcZMsHFu43fHGPIXmR0VVWPkFD6l1ynxrf1NuSSpYxP2U2yj1-eFuH_ZtYwwabjJrd9","https://play-lh.googleusercontent.com/9x0fLpUObE3Od9S9Fh__ffq4mkTo01BzB9NgVjJ0rk-aNzQV9uNj4PXH_oocA_mbeA","https://play-lh.googleusercontent.com/6k5Am4HMXPdkMk6ANkVLadWzU6VFy8Y2bZVBXiPlXKaodnwhSxoIFuMoAYaxNUyAtSw","https://play-lh.googleusercontent.com/mTw5cghn8QgJcmA4HL9-DGY2YBe1GcVo-TjlXjpt6LexeiF_SN1RzqMZ2p69LHvLxA","https://play-lh.googleusercontent.com/s_PSHRvjhjIVVrVNzt1OWKAaT5ez6TG4pM5gcPShA6Wh4j58e_pFL1EVgNt_cQ_0NQ","https://play-lh.googleusercontent.com/LOgCjzNup2tbuLyG5dz-g-1jTmEMcyUVEC5dxlanT0LC_b20CGG1iHYq1vI6TPnNe5I","https://play-lh.googleusercontent.com/eN8NBEiQXahRzGkrQpqlSABSkhI67TbRQZ_0a1WAv_sY46hPrqXyZPuqsLpE1Ywrbg","https://play-lh.googleusercontent.com/asqh3x1JgjQaAYxs4W0i3MQHYZM0ZlVBp6dbW0pk3dz2y63Pdp38ViwVpIZB31NosIkQ","https://play-lh.googleusercontent.com/iH5faDUKDGE9htj_AirVlaaJPK_pyGn9zkssFhwrUbXd2X9TdLTpWTXK7Z4UXkXBulY","https://play-lh.googleusercontent.com/-_7bMCduR41dNLvq36ts9gAMj-Gf8AByyvezUc53M-g9Wm24Fzq4GwgUqboW8sEeZe80","https://play-lh.googleusercontent.com/hfWb42PvqD1CjokHiGBSL0WgZWmyXyBQs6slstrmUYSmUHGJJJqrsieMjin0s0ZRs7O2","https://play-lh.googleusercontent.com/wMdJYWpN6dU4w8T3Py_3N2XRjOI8Aty6s6uxpFUF37IIRGTBAmYpBCkOjMmSC97AWg","https://play-lh.googleusercontent.com/GHEJrYRNL4Kxbm-2oTja61end4DWaccSh0L2lDIAGfFV2Ek3szxPsaKfp3irrqrMyQ","https://play-lh.googleusercontent.com/bR0JOEmfUBJqJaoNexCtZplcJGzSJ7Fnotti5cKbX261Am1ZmHtTmDRy_tRHrfrsovE","https://play-lh.googleusercontent.com/kILzVHiIkgG9oFgVmFW85v_VQD5cII9eGda4-W_sMCTAYpPC1YfsF_GzkB30hhVnuaU","https://play-lh.googleusercontent.com/G_rXXDYQIxhxJb59ntBsqTAZLGwcN9JTbo3RMMq4ykOUfMOWIDtrDti1N8ERhZMkPw","https://play-lh.googleusercontent.com/Ghq74-mOl3TdvDjfTbgahJBX0DU5OmBBwSKwW6ciXCzv-Jc4tORsDeqYKqG1KmFsEy0","https://play-lh.googleusercontent.com/N1WmWdwqYy9hxqD4o_bGQbr-4TJ2u9vHWydZTIrpvoCH983CRwfUn-kEiYAbFR8h9Z2R","https://play-lh.googleusercontent.com/VFJTeDwO7BoTM9W9Ah7AEziC0Qd6wBg5alMYkGOqvEsJmkd_q5WDM49zX5AiTaXe_g","https://play-lh.googleusercontent.com/8NLpZb0wS8N6nwW2KHGS5MxVBRD9o-rO5TT4v146NXv15EJMB4UYH1hYs5Ce8ZK5llk","https://play-lh.googleusercontent.com/N6PIGkfTxk_maGoxQu0JZL6DoNZej_fa7XVW_mJZy6cFt--Mt5GcpSZT8vGxWTwm1hDd","https://play-lh.googleusercontent.com/8DM-SvH-GnevIQl37qqNCVrPfoXaSrrD-qM2z41Hh2NbWE2jSXXqMlWAKjCJqxkC5mET","https://play-lh.googleusercontent.com/CnvM5Ko9swM55I8OXJaQuE9h8KfbzB4JvSORpMwsjrun3Gjfaj5Ctx-x7H_dkZfzXuU"],"video":"https://www.youtube.com/embed/SJCgp-PX1f8?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/8_PIz0GG7bDHyfid2NzWkeEsvRQ5Q1Qd4YLE7AjQmZaEhzj6rxpJdUnCRtkJ72PsdBDm","contentRating":"Everyone","contentRatingDescription":"Mild Fantasy Violence","adSupported":true,"released":"Sep 23, 2019","updated":1661189803000,"version":"1.3.4.15","recentChanges":"- Fixed an issue related to cloud saves<br>- Additional bug fixes and improvements<br>- Thanks for your continued support and feedback!","comments":["I'm taking two stars away. This game was a solid 4 until the most recent update. Now when I try to watch a video to unlock a prize, get extra currency, or to be revived; it will close the app 4 out of 5 times. The app will completely crash every once in a while. It's a shame. I really liked this game.","Found a bug. Repeated tree times. Went for a fourth and discovered there is a variable. I duplicated a card. Second use was free. Then after the round I got both of the cards back in my hand. It completely messed up the interface ui. After it happened the cards were stacking on top of each other in my hand. I got a few screen shots. I used all the cards in my hand and it reset the interface. So I did it again. After the second one I killed my self and went to scene 2-1 and did it again","I really enjoy the game but the random dice roll being tied to your damage is fundamentally flawed. I see what they were going for but at the end of the day it feels terrible to lose because of horrible luck. There is some strategy involved in the ability cards, but most of the time they're REQUIRED to win battles and not optional play styles. You could be totally min maxed with your cards and items and still get stomped by a tiny little slime because your luck is bad. Makes it hard to enjoy.","This game has really good combat mechanics between the gauge and the way you can alter it. There are also insane combos and cards(power surge) that feel overpowered but make sense when you need to work for them. The only problem is that often times when you lose a few rounds then you rely on the deck and RNG seems to always favor the AI if I can't alter it.","I think the game is very fun and very well made. It's simplistic enough to understand quickly but complex enough for strategists. I'll admit, I get very frustrated sometimes because I never seem to make it past the second worlds. But that might just be me. It's a game that rewards you for learning the mechanics and upgrading. It's so satisfying to easily beat an enemy which used to be a problem. I feel like you rely more on confidence than upgrades."],"appId":"com.armorgames.voidtyrant","url":"https://play.google.com/store/apps/details?id=com.armorgames.voidtyrant&hl=en&gl=us"},"com.gcenter.kingofdefense.battle.frontier.td":{"title":"King Of Defense: Merge TD","description":"King of Defense: Battle Frontier is a special tower defense game. The combination of turrets improves the tactics for the player. In this game, players can stack the turrets together to create the best strategy for the level. \n        The kingdom border is alarmed by the invasion of monsters. Join the heroes and warriors of the epic battle to defend your kingdom. \n        Like other tower defense games, King of Defense: Battle Frontier always emphasizes tactics. A game has many ways to pass depending on the strategy of each person. By the way, King of Defense: Battle Frontier is always new and not boring.\n- NEW FEATURES:\n        ★ The turret stacking and combining feature gives players more options for the best tactics.\n        ★ The systems of heroes and turrets are rich and powerful upgrade. Many options upgrade according to the player's strategy.\n        ★ Diverse terrains like deserts to jungle and frigid lands. Players need good strategies for each type of terrain.\n        ★ Diversity of monsters from flying monsters to monsters with special skills.\nLet's experience the new challenge and unique strategy game - King of Defense: Battle Frontier.\n---------------------------------------\nContact us for further support and information:\n- Official Fanpage: https://www.facebook.com/KingOfDefense.BattleFrontier\n- Official Group: https://www.facebook.com/groups/KingOfDefense.BattleFrontier","descriptionHTML":"King of Defense: Battle Frontier is a special tower defense game. The combination of turrets improves the tactics for the player. In this game, players can stack the turrets together to create the best strategy for the level. <br>        The kingdom border is alarmed by the invasion of monsters. Join the heroes and warriors of the epic battle to defend your kingdom. <br>        Like other tower defense games, King of Defense: Battle Frontier always emphasizes tactics. A game has many ways to pass depending on the strategy of each person. By the way, King of Defense: Battle Frontier is always new and not boring.<br>- NEW FEATURES:<br>        ★ The turret stacking and combining feature gives players more options for the best tactics.<br>        ★ The systems of heroes and turrets are rich and powerful upgrade. Many options upgrade according to the player&#39;s strategy.<br>        ★ Diverse terrains like deserts to jungle and frigid lands. Players need good strategies for each type of terrain.<br>        ★ Diversity of monsters from flying monsters to monsters with special skills.<br>Let&#39;s experience the new challenge and unique strategy game - King of Defense: Battle Frontier.<br>---------------------------------------<br>Contact us for further support and information:<br>- Official Fanpage: https://www.facebook.com/KingOfDefense.BattleFrontier<br>- Official Group: https://www.facebook.com/groups/KingOfDefense.BattleFrontier","summary":"The key strategy to win tower defense battles","installs":"1,000,000+","minInstalls":1000000,"maxInstalls":2785570,"score":4.5333333,"scoreText":"4.5","ratings":29277,"reviews":553,"histogram":{"1":1936,"2":699,"3":340,"4":3011,"5":23235},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $39.99 per item","androidVersion":"4.4","androidVersionText":"4.4","developer":"GCenter","developerId":"6177492284961668428","developerEmail":"doanhtu.gcenter@gmail.com","developerWebsite":"http://gcenterstudio.com","developerAddress":"Thanh Cong, Ba Dinh, HaNoi","privacyPolicy":"https://gcenter-com.webnode.vn/privacy-policy/","developerInternalID":"6177492284961668428","genre":"Strategy","genreId":"GAME_STRATEGY","icon":"https://play-lh.googleusercontent.com/89Oyrz6xH3JZlERG0_bY-a946TOZhk_77H1vgPTePR5B6xFRjYVCwLtEAXtdcNiaWjAF","headerImage":"https://play-lh.googleusercontent.com/xFrHC_SF-SPAZ3yhC-9w7pOLjQf_QIf8l7ylsrNcqT4CmSTt6sQAhHifmssGDQqpxUE","screenshots":["https://play-lh.googleusercontent.com/ewjvYeeuDsKA8Fd0efEMnTiMVB_z4jdgZsV_A8R1syuBELgpGM_L6ODNKnc5zgVz6eLl","https://play-lh.googleusercontent.com/qJeQy-ogv2marEYIc9TJp34HLBvIKC_dlzWUjGy2VUiZT1FbHeNIBPthWGm5FeWQxLuy","https://play-lh.googleusercontent.com/Hwp3BVa1eWLQBb2aM-Z3MVCObYYeoupAoirWTutJpLP2JAk6vhT4rQnhKwTLXDWbvQ","https://play-lh.googleusercontent.com/7dtepYTbwX1s3HdoEiAzNgx-xFK-g24R-H6WXhM-BKtQVsWEfY1SY0iJChzlCMsktg","https://play-lh.googleusercontent.com/KLzoukDZKRrVyDMrfOE3hwvAKA9aSs_WlSCibpgdrEdWHV7reT2fX1wncyqASzeffw","https://play-lh.googleusercontent.com/s_4SkUqWiDo-Xn00Wue3eaUrw8FYCMGFsYJmFac5d1BYbSS1SeKWCnSwcRvmkIJUuMY","https://play-lh.googleusercontent.com/vxcGP9lQlcDgSkauWNWE_OdIfsDaf_s06026FTU-LY5sVFh5vffxO7WvyCnmjzliHIlE","https://play-lh.googleusercontent.com/MNUq3CtvcAds3xGKBW-brfa74U3reN11m1oLDUrhglPIgdWOClXTgwPp8pLbYwIXF4o","https://play-lh.googleusercontent.com/w_f2Khr4_rT4KY9hhCOY62bP6mmiUJ6NkHR-i2Ie2-DebudP1DWfCk9Hzq7gQsEn-78","https://play-lh.googleusercontent.com/ZWU6A6C9p_v91ieDB1IPzVvNwY-L0wUBiOhx7mttxfuRrB5fGoXzq4PYqy1xZW1AQw","https://play-lh.googleusercontent.com/eVBGuPdb2cS3s6wyMz_ibKr4ur2nuc5z91FA9dxY9N3atornRZ_mtncdJA1LwqZrnQ","https://play-lh.googleusercontent.com/wV5wejOwyWXDkEfBsGOzMWPoMWlGS5P5kF6H2-RlFf1Uwp1h0gi9NTtuGWX69-24bYg","https://play-lh.googleusercontent.com/_ENr9hFAEO7PD-ZARXvHque9gbT5JrzSKisDO1gcY9JP_vhvUFgoOQKWx2RhpWlSCkk","https://play-lh.googleusercontent.com/mQAQV7sPstCodL-hf38crUsvV_WSowlmbMDRA_O5g8_4rRmffHyXQQOJ98JcGBx21A","https://play-lh.googleusercontent.com/SHuV4NppD2eTlyySzh-ATRW4EGyABIHlNKZNugbjSOPrNTF-zQRQFCoZvjyphelJDik","https://play-lh.googleusercontent.com/SvI_DoH8XO0RX1iaXjYpoFKV-0Hxs8Gv3pdN9Vj65G_6G4D1GDeb_iBAfXGbPwCNSXY","https://play-lh.googleusercontent.com/cXQ5i21Zb9LsCWviBDZm9LG7GKyj54TzgDxwvvLXfHeiRnqbnVak7mgy7LnTMgUtKLz_","https://play-lh.googleusercontent.com/ogBnEPHPGlqYwK3no5ZxNWpHwkw__tvPeTRQTHKsmyiAxaO58LXtrTWt_W80R9XQeVg","https://play-lh.googleusercontent.com/3nQ2oG3EeXkCBAxUnw-k6WPaPYRwzHGR_NUCo6XFMcrboYUmcaJ4QOowxNHg2Zu_dgM","https://play-lh.googleusercontent.com/BdBnKzd-WnG94KzxMizeA3DX9062i9sVI3G39LtOpFoO5V4871Vkc-JRNHlQeUvYDoA","https://play-lh.googleusercontent.com/MrGvIck2uJVxgL1rx8_lRxhFuPq740JxzJfchxpDLwL0tm2u58IVTul5Lp8f219SBes"],"video":"https://www.youtube.com/embed/z1pkrknhRvg?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/xFrHC_SF-SPAZ3yhC-9w7pOLjQf_QIf8l7ylsrNcqT4CmSTt6sQAhHifmssGDQqpxUE","contentRating":"Everyone 10+","contentRatingDescription":"Fantasy Violence, Mild Blood","adSupported":true,"released":"Jul 1, 2020","updated":1661321004000,"version":"2.0.2","comments":["Keeps me busy. Sometimes it requires patience, but that makes it easier to integrate into the rest of my life. I wish there was a single button (hit again to confirm) that would put it into pause mode and return to \"desktop\" without losing one's place in the game. In general, the battles are fun, and finding/achieving upgrades are satisfying, but sometimes frustrating. It has adequately filled the empty times in my life.","The gameplay mechanics are great. Combining tower types is a great ability that sets this game apart from other tower defense apps. I haven't felt any need to purchase anything so far in order to win, so that's a win. The downside is the grammar; sometimes the English translation is so bungled that you can't understand the directions. Doesn't make much of a difference on gameplay though, just makes the game feel cheaper.","As I fan of TD games I like this one but it has its issues. Great maps, worlds, towers, levels, heroes, and graphics. However it relies on ads waaaay too much and some levels/enemies are incredibly difficult to beat/kil and the heroes only gain experience if you beat the level (veeery slow progress at times.) Also there are too many options and spending money does not guarantee progress. The heroes to get are Satan, scorch blaze and Brion (I have not unlocked Waylin.) Don't get andor or cercle.","I want to see how much money and time the positive reviews spent on the game! One of the most egregious examples of forced pay to win I've ever seen. On level 11 they have a map with an area your champion can't reach and there are not enough tower slots to stop the enemy mobs. The solution? Pay $0.99 to unlock a champion trapped in a cage up there. If that is not obvious enough, the cage bounces over and over during the match as you are losing, trying to get you to pay up before it's game over","Ok. People were complaining about unfair gameplay so I actually didn't spend a penny. (I usually get beginner packs and bonuses early since that's when they are most useful.) Yeah, it's tough but I went to 11 to see what the fuss was - yes you can cross the chasm with your hero. Just advance slowly. And you get the wolf free once you win that level. You don't need to buy it. Okay, so that's settled, I'm buying stuff now. (Again, it's hard but not impossible.)"],"appId":"com.gcenter.kingofdefense.battle.frontier.td","url":"https://play.google.com/store/apps/details?id=com.gcenter.kingofdefense.battle.frontier.td&hl=en&gl=us"},"com.Gcenter.KingofDefense2.epic.towerdefense":{"title":"King of Defense 2: Epic TD","description":"The sequel to King of Defense: Battle Frontier is King of Defense 2: Epic Tower Defense. New heroes, turrets, and invaders will debut in this sequel, which creates epic battles. The combination of turrets, which is the essential value of King of Defense, stays unchanged. In addition, heroes with excellent combat skills will aid in the defeat of the invaders.\n\tThe key to protecting the kingdom from aggressive monsters is strategy. Each must develop their own distinct and unique tactics to firmly defend the peaceful land.\n\tRole-play as heroes in battles to gather power and awaken the potential within your heroes. Gather the necessary equipment, which includes spells, powers, techniques and tactics, to aid in preventing enemy attacks.\n\tGo on adventures and explore the world of frozen lands, scorching deserts, land of the gods, and charming kingdoms hidden in the woods. All of those lands are waiting for you to arrive and defend them from the onslaught of ferocious monsters.\n\tLet's fight it out in King of Defense to become a legendary hero.\n        - FEATURES:\n        ★ Stronger turret fusion with new turrets.\n        ★ New heroes, who have been considerably enhanced and equipped with support items earned in battle to help them improve their skills.\n        ★ Provide players with more game modes to choose from.\n        ★ Many enemies with rich and unique abilities, as well as a wide range of attacks, pose a significant challenge to tower defense fans.\n        ★ High-definition graphics and a lively soundtrack.\n---------------------------------------\nContact us for further support and information:\n- Official Fanpage: https://www.facebook.com/King-Of-Defense-2-Epic-TD-100906102417564\n- Official Group: https://www.facebook.com/groups/292775049384323","descriptionHTML":"The sequel to King of Defense: Battle Frontier is King of Defense 2: Epic Tower Defense. New heroes, turrets, and invaders will debut in this sequel, which creates epic battles. The combination of turrets, which is the essential value of King of Defense, stays unchanged. In addition, heroes with excellent combat skills will aid in the defeat of the invaders.<br>\tThe key to protecting the kingdom from aggressive monsters is strategy. Each must develop their own distinct and unique tactics to firmly defend the peaceful land.<br>\tRole-play as heroes in battles to gather power and awaken the potential within your heroes. Gather the necessary equipment, which includes spells, powers, techniques and tactics, to aid in preventing enemy attacks.<br>\tGo on adventures and explore the world of frozen lands, scorching deserts, land of the gods, and charming kingdoms hidden in the woods. All of those lands are waiting for you to arrive and defend them from the onslaught of ferocious monsters.<br>\tLet&#39;s fight it out in King of Defense to become a legendary hero.<br>        - FEATURES:<br>        ★ Stronger turret fusion with new turrets.<br>        ★ New heroes, who have been considerably enhanced and equipped with support items earned in battle to help them improve their skills.<br>        ★ Provide players with more game modes to choose from.<br>        ★ Many enemies with rich and unique abilities, as well as a wide range of attacks, pose a significant challenge to tower defense fans.<br>        ★ High-definition graphics and a lively soundtrack.<br>---------------------------------------<br>Contact us for further support and information:<br>- Official Fanpage: https://www.facebook.com/King-Of-Defense-2-Epic-TD-100906102417564<br>- Official Group: https://www.facebook.com/groups/292775049384323","summary":"Become a hero who defends the kingdom with ultimate strategy and tactics.","installs":"100,000+","minInstalls":100000,"maxInstalls":333689,"score":4.34,"scoreText":"4.3","ratings":5639,"reviews":153,"histogram":{"1":382,"2":168,"3":275,"4":1069,"5":3713},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.49 - $40.99 per item","androidVersion":"5.0","androidVersionText":"5.0","developer":"GCenter","developerId":"6177492284961668428","developerEmail":"doanhtu.gcenter@gmail.com","developerWebsite":"http://gcenterstudio.com","developerAddress":"Thanh Cong, Ba Dinh, HaNoi","privacyPolicy":"https://gcenterstudio.com/privacy-policy/","developerInternalID":"6177492284961668428","genre":"Strategy","genreId":"GAME_STRATEGY","icon":"https://play-lh.googleusercontent.com/tpYwZnfymthUN7YE2AXuQP9G5BXqE4ABMtImYhAT4Rx0kG-4PsCsldR-6CAgU3yu62o","headerImage":"https://play-lh.googleusercontent.com/wRxeryubIzoy1fd5K7K6mzeGMvWh8Js7f5C6EgXLZdu_Y5sSVVY_clpmmwM9xT5Ixq0","screenshots":["https://play-lh.googleusercontent.com/GRXd-uZsYXcUuBHrikoy_gswHmYRIZGqfvFoe6nOXiFYTaRjZRKzS-HRusn-p9Z0dIA","https://play-lh.googleusercontent.com/vlnBU4QoQNK2WfJtmn-BlJK61oHromutPc8oo5HSpd5nUm6PHDsxxt0P7IaRwBAqWA","https://play-lh.googleusercontent.com/IhHWc9B1CbjHNqaaMjhlMaF9KM2dlWNJCaFvA8YeWxIIxUu3N4LSNGBS1UYxHr35NBU","https://play-lh.googleusercontent.com/loptnmvxLCmlYnbiqOEoQqDUHR9jB-NBqUK_DPWOM97I9TBLu7CTOAHGXI9z4MRkskg","https://play-lh.googleusercontent.com/9EL3arpFd9D3IwERbj53x5ORTSHY4fanXTNYZFyttLo2Ifax6zdn8mOPqobKGE1ifR8V","https://play-lh.googleusercontent.com/az260pltfDk7mgxQ-Ws_DGa8roUKB4wRZlAsW0WSuNd8f6fOgyeWvixFSwJiCj14dUg","https://play-lh.googleusercontent.com/lEsVs6QpJBXGuSfBrOku3S4gyk_QXbqIPzvZbZd_D10U8kdVkWywOxTaJpYYxG1j_Q","https://play-lh.googleusercontent.com/jIwsVRkOk3oU7rReljQP0H--uGQ4w23n9Vyke1oFLPMjhdXCnXEkJu1VkYbgs1wsuUc","https://play-lh.googleusercontent.com/Z8uX_HPqIHJDqqn41ibU_SRQ7NI8Tnp66eTb8806tAr7K5WfwUovQnIg4itaW3S9SWA","https://play-lh.googleusercontent.com/QAu0KtxGhxz08rPZwK3TsuLphCdwBOi4lkTjNvGyibSFMzoyAVcT8GZaHziC_lMNDarI","https://play-lh.googleusercontent.com/sJsZFRZQnb7DFpDgNKdfFCLfm5Ab0l3e3hNjR58QNIfjL8YcPCXOJNjdqzPaKk39ug","https://play-lh.googleusercontent.com/mdafPzQ3yrsbzOq4C8BMN8r4rhrx3aymF2vauWgdNqcewWragZGyRFqpy3UoDYXZJTw","https://play-lh.googleusercontent.com/GlQ6mRUEfer9bgewgUwpUi7dNOHk-Oy4FlaoC4nQB083wzg7j_SAlWwH_x0vqrotidQ","https://play-lh.googleusercontent.com/1wih-8aH58y8ffBw-2JeH7yTzBWB-gVYLrylVU9E5LySb1JWtEdewILCDcasfyYRKQ","https://play-lh.googleusercontent.com/f14LOMPZwXK9JqRLiEVHooaiAwVJfvthUaHzguL0FQT148SoVgE0iIL0hqZ8kl6pUic","https://play-lh.googleusercontent.com/v9HDp_kGioQvBvzaGEg24fDbgK0hGqoEWGY_AjyiEMGE3I5UQWRwFkbFzOY7kIinl-0","https://play-lh.googleusercontent.com/r_mvLfMxlAhG-Od2pqw3-77nPz5OBYfjV6vFeUnntGvsTVI8z0GBObzm72w3MPmhkxs","https://play-lh.googleusercontent.com/hQYUFKy0S29J4CF5HS1aMw0lul0MDoJ0amVDPWFhiiCUPmtRX0vRO1Fh6yFnqtFWo3Y"],"video":"https://www.youtube.com/embed/OvijJyf1zBM?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/wRxeryubIzoy1fd5K7K6mzeGMvWh8Js7f5C6EgXLZdu_Y5sSVVY_clpmmwM9xT5Ixq0","contentRating":"Everyone 10+","contentRatingDescription":"Fantasy Violence, Mild Blood","adSupported":true,"released":"Jan 24, 2022","updated":1660376340000,"version":"1.0.37","recentChanges":"- Optimize and balance game","comments":["This is a good, not great game, yet. I think it has potential. First of all, lower the cost of, everything... Make it easier to obtain items, heroes, magic and so on. When you first start playing, you get a nice win streak going on then, you hit a brick wall. Unless you play already completed levels a hundred times over to rack up some crystals, gems, items and etc. Or, of course, you pay to play. Also, when I direct my hero to move, why does he run half way then go back?!","Pay-To-Win: Name of this game is simple. If you want to make it past the first few levels, open your wallet. It is a well put together game with great design and mechanic choices. It's too bad it is impossible to get past level 14 without buying your victory. This is a fun way to pass a few hours, but you will quickly delete it unless you're willing to buy your way past the very apparent pay-wall.","Starts out pretty fun but the difficulty scales up ridiculously quite quickly as a clear play to push players into microtransactions to progress without extensive grinding of earlier levels to eke out a tiny bit of progress after days or weeks of playing the same missions repeatedly and constantly bombarding you with pop-ups for \"deals\" on premium currency, heroes, pets and so on. A good example is that you \"unlock\" pirate hero but it really just unlocks the ability to buy him. Trash.","The game is great, I enjoy it, and the ads are not invasive, but there is a very annoying bug... In the tournament supposed to be 100 levels. I got to 25 and the game just stops. If I get out of the mode, then I lose the progress. It is very annoying as I spent a lot of time on it. Also, it is not clear where and how to contact support if there is any.","Good but too many adds. Even the tutorial forces you to view pay only upgrades. There are adds and pay options everywhere on the screen. Clean it up and stop forcing the pay to play might be better than the first game."],"appId":"com.Gcenter.KingofDefense2.epic.towerdefense","url":"https://play.google.com/store/apps/details?id=com.Gcenter.KingofDefense2.epic.towerdefense&hl=en&gl=us"},"com.lemonjamstudio.infiniteknights":{"title":"Infinite Knights - Idle RPG","description":"The good King had died, and no one could decide.\nWho was rightful heir to the Throne.\nIt seemed that the land would be torn by devils,\nOr saved by a miracle alone —\nAnd that miracle appeared in the countryside of the the kingdom:\nThe Sword in the Stone.\nThe one who pull the sword, will become the king and lead the knights to defeat devils.\n\nAre you the one, who can pull up the sword?\n\n■ Addictive Turn-based RPG \nGet to Floor 2000 and defeat the Devil King\n\n■ Automatically Offline Income! \nYou can upgrade the village, get incomes while you are offline.\n\n■ Infinite Heroes\nAll heroes are randomly generated. Find your best knight.\n\n■ Infinite Dimensions!\nYou can cross to other dimensions after finishing Floor 100.\nUse the soul stones in other dimensions to infinitely power up your knights.\n\n■ Auto Mode/Manual Mode\nYou can use auto combat mode in the game. If you find it too hard, you can switch to manual mode to pass it.\n\n■ Manage your own team! \nStrategically use 9 heroes with different classes to pass the difficult levels.\n\n■ Forge your own equipments. \nUse materials to forge many kinds of equipments.\n\n■ Get hundreds of items and materials! \nUse the items and materials dropped by the Boss to power up your team.","descriptionHTML":"The good King had died, and no one could decide.<br>Who was rightful heir to the Throne.<br>It seemed that the land would be torn by devils,<br>Or saved by a miracle alone —<br>And that miracle appeared in the countryside of the the kingdom:<br>The Sword in the Stone.<br>The one who pull the sword, will become the king and lead the knights to defeat devils.<br><br>Are you the one, who can pull up the sword?<br><br>■ Addictive Turn-based RPG <br>Get to Floor 2000 and defeat the Devil King<br><br>■ Automatically Offline Income! <br>You can upgrade the village, get incomes while you are offline.<br><br>■ Infinite Heroes<br>All heroes are randomly generated. Find your best knight.<br><br>■ Infinite Dimensions!<br>You can cross to other dimensions after finishing Floor 100.<br>Use the soul stones in other dimensions to infinitely power up your knights.<br><br>■ Auto Mode/Manual Mode<br>You can use auto combat mode in the game. If you find it too hard, you can switch to manual mode to pass it.<br><br>■ Manage your own team! <br>Strategically use 9 heroes with different classes to pass the difficult levels.<br><br>■ Forge your own equipments. <br>Use materials to forge many kinds of equipments.<br><br>■ Get hundreds of items and materials! <br>Use the items and materials dropped by the Boss to power up your team.","summary":"Addictive Turn-based RPG. Manage your kingdom and defeat the Prince of the Devil","installs":"100,000+","minInstalls":100000,"maxInstalls":444515,"score":4.1505375,"scoreText":"4.2","ratings":13615,"reviews":840,"histogram":{"1":729,"2":292,"3":2268,"4":3219,"5":7098},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $94.99 per item","androidVersion":"5.0","androidVersionText":"5.0","developer":"Lemon Jam Studio","developerId":"8588152049236454312","developerEmail":"wilson@lemon-jam.com","developerWebsite":"http://lemon-jam.com/infiniteknights/","developerAddress":"Unit 504, 5/F, Yip Fung Industrial Building, 7 Sheung Hei Street, San Po Kong, Kowloon, Hong Kong","privacyPolicy":"http://lemon-jam.com/privacy-policy/","developerInternalID":"8588152049236454312","genre":"Role Playing","genreId":"GAME_ROLE_PLAYING","icon":"https://play-lh.googleusercontent.com/pH9IvTy5ZQEnTRnWHtgD3zyts8oKTX1lsyYVhynJpO_zfajNCxgPmm1Q-nIop7zCk0Q","headerImage":"https://play-lh.googleusercontent.com/EHui9i3UFmV1HdLJfP3QqxSt94GBcnBMHQD3SvPfQSWqg4NVGzfzVDdyVV3KYMNaVwQ","screenshots":["https://play-lh.googleusercontent.com/gFoPKQaFNixeoABIGS73hlrQMWIhARecbxBqIkePXfeHS7Z5y0yiN5vut8w89KDkJq6K","https://play-lh.googleusercontent.com/QEbsfN7B-8os-xHYVW_VKAdo5Ej6NRoLTIvA-XrDIR29uiCJ5VqD3hugueCjxz6oayk","https://play-lh.googleusercontent.com/3TQXZ7iA5jzM40V3rCC4JFStEs4iMM_0_b5efQBkG7U6vorYsp7ZBWxRMrYJd_b5mnEr","https://play-lh.googleusercontent.com/_entnIDXfZcIRPo6NZGdpXc_h1SeuMSlA1nnC0RQ7jKQTKRKbo9BrFRcvoqBahiSrTOS","https://play-lh.googleusercontent.com/PEJeXR5A3WXdHJYrmYuF1gxWMNH0pIHKATRJXXOSdmCVhTbEJxcWujPVpboHlfBImg","https://play-lh.googleusercontent.com/82wA3HKTlXLx4ozzWvmK2pQz--bl16YSDksc6Ickr8cC2Rq_61700tg6KDua410pog","https://play-lh.googleusercontent.com/941b2UnlA93NeqffoGyTcz8iqlPVUjFN5T0P8vnpqWHCKxkhdrh2uXle3LMrQRgJyg","https://play-lh.googleusercontent.com/aOMXzf5rERDxZBW56-61OdYOHqXHsXZy27YPfHnDunUcxsoFUao7O0ycrv_mvzf_eNHP","https://play-lh.googleusercontent.com/rf0lmHqD_z0PZ6ZjG8DyLM4eSNxs2zv8lllXl0l6gPpIvLETFz-YNGC1mTUz0UIZFlep","https://play-lh.googleusercontent.com/BQ5g27iA1lT_ZgbTNJUfaKJ_rVfhbjbAfkvNm45R3ImIjFe4Y7inx-LjiISnow8sgT4","https://play-lh.googleusercontent.com/HRSl9R4dMv6RG8zaap3eEw_BX_YUWcNeohdQav2K_6a3cIgy8pByIKTQVcuumWwhoM8","https://play-lh.googleusercontent.com/idV869uBN0ZlWiVZeo5p4vPyrrrWRkVgd0SyVkWGCcaTz5dKoW-xv0f-VPnsu63HMUy6","https://play-lh.googleusercontent.com/bkN9qFnYlkQv75ZIllkG3RktzkZoH92E3idUWiEdGZ-omBdm_oEBlJucKMSehIVIZgtc","https://play-lh.googleusercontent.com/xiz8OEHQ16ysyJ7ijhUdiyNI1_qrz8tHKUcGdD-RwTcKAHY5yBLiL6JGD_PF2mf0h0Ly"],"video":"https://www.youtube.com/embed/BEv4kTOoDzY?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/EHui9i3UFmV1HdLJfP3QqxSt94GBcnBMHQD3SvPfQSWqg4NVGzfzVDdyVV3KYMNaVwQ","contentRating":"Everyone 10+","contentRatingDescription":"Fantasy Violence","adSupported":true,"released":"Nov 21, 2018","updated":1638936015000,"version":"1.1.27","recentChanges":"Bugs fixed","comments":["Slow money grab. Concepts can be fun but daily rewards are just options to watch more ads. Almost every action brings new adds. Sometimes it displays the button as an ad other times it says claim but is an ad. There is no option to go completely ad free. Just every time you purchase gems you get a few ad free tokens, this is also on top of a monthly subscription that doesn't prevent ads. Based on the first 20 minutes of gameplay i had 10 adds, so I'd say there is an average of 20 per day.","Its a fun game for the most part, alot of ads if you want to do stuff, but hey they have to make money too....only issue is that i think its a dead game, no discord, and no directions on what things do... .like the alter of new heros, has quest to unlock new heros, but after you complete the quest it lets you \"level up the class\" but as far as i can tell it does nothing","Great, simple fun, combining standard turn based rpg and idle gaming. Only drawback is you can't manage their equipment, there's auto-equip, then that's it, what they grab is what they have, seemingly forever. Making it virtually impossible to keep the same characters competitive over time as their equipment will simply get outdated and you can't upgrade it. Just to make it worse, the auto equip will make some wonky choices.","Love the gameplay. Easy to pickup and learn how combat works. The characters look great and I love how they have different appearances. It might just be a issue with my game, but any time I attempt to load a ad, the game freezes then crashes. The sound is missing from gameplay as well. Overall, a great game but a issue lowers my rating.","So it's a good game, but there are some glaring errors: 1) Please change the \"can't fetch ads\" pop-up! If I'm connected to the internet and YOU can't fetch ads, that's your problem not mine so don't ask for payment because you failed. 2) Increasing the star-level of items you make should always be done with gold (maybe with a video option if you can't afford the gold)! Watching an ad should be a choice, not mandatory. This is compounded by error 1 too!"],"appId":"com.lemonjamstudio.infiniteknights","url":"https://play.google.com/store/apps/details?id=com.lemonjamstudio.infiniteknights&hl=en&gl=us"},"com.yodo1.rodeo.safari":{"title":"Rodeo Stampede: Sky Zoo Safari","description":"Saddle up and get ready to wrassle with the stampede-iest critters this side of the Savannah. Lions and Tigers and Bears are no match for this rodeo star. Armed with a lasso and a ten gallon hat, swing from the backs of stampeding buffalo, elephants, ostrich and more. Hold tight atop these bucking beasts and you might just win their hearts. When the stampede’s over, the zoo begins! Fill enclosures with your four-footed friends and let your patrons gaze in wonder. This is one wild ride that you will not want to miss - YEEHAW\n\nRide through the wild stampede on the backs of buffalo, elephants, and all types of exotic animals\nDodge and avoid obstacles in your chase for high scores\nCatch and befriend animals of all shapes and sizes to show off in your Sky Zoo\nCollect a wide variety of hats for your character to wear\nInvite visitors to come admire your collection\nExpand and Manage your zoo to earn huge rewards from visitors\nWild Endless Runner Adventure\n\n[Required Access Authorization]\n1. Storage\nAccess is required to share screenshots and screen recordings of the app on social media platforms.\n2. Screen Recording \nAccess is required to share the gameplay videos of the app on social media platforms.\n[Optional Access Authorization]\n1. Phone\nAccess is required to run in-game events, reward prizes, and check OS version and device model to handle customer inquiries. \n※ Optional Access Authorization will not affect your gameplay experience other than the related services stated above.\n\nPrivacy Policy：https://www.yodo1.com/privacy","descriptionHTML":"Saddle up and get ready to wrassle with the stampede-iest critters this side of the Savannah. Lions and Tigers and Bears are no match for this rodeo star. Armed with a lasso and a ten gallon hat, swing from the backs of stampeding buffalo, elephants, ostrich and more. Hold tight atop these bucking beasts and you might just win their hearts. When the stampede’s over, the zoo begins! Fill enclosures with your four-footed friends and let your patrons gaze in wonder. This is one wild ride that you will not want to miss - YEEHAW<br><br>Ride through the wild stampede on the backs of buffalo, elephants, and all types of exotic animals<br>Dodge and avoid obstacles in your chase for high scores<br>Catch and befriend animals of all shapes and sizes to show off in your Sky Zoo<br>Collect a wide variety of hats for your character to wear<br>Invite visitors to come admire your collection<br>Expand and Manage your zoo to earn huge rewards from visitors<br>Wild Endless Runner Adventure<br><br>[Required Access Authorization]<br>1. Storage<br>Access is required to share screenshots and screen recordings of the app on social media platforms.<br>2. Screen Recording <br>Access is required to share the gameplay videos of the app on social media platforms.<br>[Optional Access Authorization]<br>1. Phone<br>Access is required to run in-game events, reward prizes, and check OS version and device model to handle customer inquiries. <br>※ Optional Access Authorization will not affect your gameplay experience other than the related services stated above.<br><br>Privacy Policy：https://www.yodo1.com/privacy","summary":"Catch wild animals in the stampede to grow Sky Zoo in this endless runner.","installs":"10,000,000+","minInstalls":10000000,"maxInstalls":49194383,"score":3.8994515,"scoreText":"3.9","ratings":922338,"reviews":31859,"histogram":{"1":141889,"2":48240,"3":88581,"4":125544,"5":518042},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $29.99 per item","androidVersion":"7.0","androidVersionText":"7.0","developer":"Yodo1 Games","developerId":"6269370758281416227","developerEmail":"support_rs@yodo1.com","developerWebsite":"https://yodo1.com","developerAddress":"Yodo1 Hong Kong Limited\nUnit E, 17/F King Palace Plaza,\n55 King Yip Street,\nKwun Tong,\nKowloon,\nHong Kong.","privacyPolicy":"https://www.yodo1.com/privacy","developerInternalID":"6269370758281416227","genre":"Casual","genreId":"GAME_CASUAL","icon":"https://play-lh.googleusercontent.com/bxmRR1Ir0K0rb-abpRk4yHNdB5OCydWuVbl1xNac_tCdu27WnVy-dWNm5Uaif-22-g","headerImage":"https://play-lh.googleusercontent.com/N6ZXSMo-cpb8oh9Gj6P1731JjTPfmPyQXoa3tBkzaXfpxUWavVZLNHnSZ15wtutUPQ","screenshots":["https://play-lh.googleusercontent.com/8Aevd-tYRbUEdnktk4c3-RUiWaFwy2s567ePxfIh20B9n4LFTvuGlsUg6J0MuQncsw","https://play-lh.googleusercontent.com/MIYyzG5M0tH1uIgiH8xKhOIWP2OH-ePaAbXV4pjwfdNZAs-mwUDAMjTYivYL32Ym6hQ","https://play-lh.googleusercontent.com/hUHM4s5SXG_G9V-ac2ZFRza8CAz0q_iSLuSYZQK-1jKWuSy0cHN1FR49iFCUnbM6SSKQ","https://play-lh.googleusercontent.com/2xtkMKRdVNhyxLzE3vjzFjmGWtq5qplrDu6rCVoUcn5N2TXp8xlMTphVQHj-cXfOeME","https://play-lh.googleusercontent.com/lN0fLpbxho20UuCnedWEz7i7WrEE-yiLHn_8pXEOPlrpqJdMhyzo99FnicLPFnCjmg","https://play-lh.googleusercontent.com/QYxvm7N4OgJ9OyoDnwVmtg0bWobZaDuKLYuWFGggVkQqpCYTn8QIBxbiSGsu4YzOv1hI","https://play-lh.googleusercontent.com/cQSnb3dkuxgMMXV4Nf8AuGVWU4FzdylcAybmebWusN7XB9HADRla6m6QCLn8gxxhKw","https://play-lh.googleusercontent.com/DIUjlK-4cL8dspOpMF291kqs3notbQDvT11Q6MSJOeIWYl6sRxrKGse1YnwX5DM5b5kp","https://play-lh.googleusercontent.com/gyU8Zz_Ri6GzJjSTb4_o25Lq8KTlqtcpEfviwwPjDu36lNkP9bj5DANyVyPvbFH-xRI","https://play-lh.googleusercontent.com/_TjXbxIuMbb4QzaTWt48hIWfmWSRstJm8ufArzHuld5IsVHAIPfSpl8EpTPYE_Fz-A","https://play-lh.googleusercontent.com/Xbl3I9IOUm4OTgcwfpEFQ_K9E5D6MkCE-y8Z6Tw0d12V-9zq4ewyGMkRelh0ExHZ4LE","https://play-lh.googleusercontent.com/HNjDeGQRiiubJ5EQeeT4CW917EpvGxaJXe7H2FHgn_1Sa7N4ngSCLfMDQ6NKI0FXN8Q","https://play-lh.googleusercontent.com/HRgE4wlL8Cd6-rkMvkafk2v9nzxggjUKwHcTiaMH9rvTcUOmfFtkD-sWV_A8DRcQfMu8","https://play-lh.googleusercontent.com/Yo1kWZ8gi5HpxgbX0jYhcfjyf4XC-M0Y9FG-AB1cuYP-EzVsXv-1cULNCG3MOsRUdM1d","https://play-lh.googleusercontent.com/SpMlFpQRIypapY82ySBdMmstg0kLLYf0YyJUMzDlUWBwCWTsHb5amoiv0CZNuaoSOGI","https://play-lh.googleusercontent.com/pJKHF5kd4cwko4xWPf7wShTU8aGDFrGP7C85yzZ-QEOMy7Sy2AH8jlkbEDOuvE_zrw","https://play-lh.googleusercontent.com/XHBw6u8m8-iB7xpkciVdYqDbTLizKDF5YxiSfxteDvu1wmbuV5tvwJIIySOQ40LBgdM","https://play-lh.googleusercontent.com/P3KTzFgZgVInFBFeIyAQn9NwqITlftQNl4q1flKqOMznpjvdrWuKAyYXa6r-V1dHaQ"],"video":"https://www.youtube.com/embed/06B-t8gHRuM?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/N6ZXSMo-cpb8oh9Gj6P1731JjTPfmPyQXoa3tBkzaXfpxUWavVZLNHnSZ15wtutUPQ","contentRating":"Everyone","contentRatingDescription":"Mild Fantasy Violence","adSupported":true,"released":"Jun 22, 2016","updated":1660921325000,"version":"2.6.0","recentChanges":"Ahoy cowboy! The dolphin that you have much asked and long waited for, is here!<br><br>4 new dolphins to encounter in the wild!<br><br>2 exotic dolphins with an ocean romance that can only unlocked via completing the puzzle challenge!<br><br>Join now and discover an ocean full of wonders","comments":["I love this game, I really do, but it seems unplayable at points. I don't think you should have to put your device into airplane mode just to avoid the amount of ads that get dumped on you. It's VERY annoying. After just about every time you die there's an ad waiting for you. While I realize ads mean money and as a company money needs to be made, there are ads to double coins, revive, etc. Those are fine. You can purchase something from the shop to get rid of them, but I don't have money to drop","When i first installed this game it was super fun. All you have to do to get rid of the ads is turn of your wifi and mobile data but when my zoo started to get bigger and bigger it now has so many bugs to the point where I don't enjoy the game anymore. Every time I try to play the Jurassic park it always stays on the loading screen and i always have to restart it. I think if yodo1 would fix these bugs I would and everyone else would enjoy this game much more but that is why I give this 2 stars.","Game is fun most of the time but it's overrun with ads, after almost every loading screen there's an ad, if you ever play this game I recommend putting it in airplane mode to get rid of the ads. (Note for response: I understand that revenue is needed from ads but it shouldn't get to the point where it ruins the experience, I now fear messing up a run because that means I've got to watch an ad afterwards, but I want to make it clear this is a good game)","I have contacted support for multiple big issues. It's been days without reply. Playing in the space zoo, once I finish the last of the 3 missions and the run is over,there is no 'done' button just a blank screen and I have to exit and open the game again, completely losing the ability to upgrade any space zoo enclosure. So the game just acts like the missions never happened and I get 3 new missions but no enclosure upgrade. The game has gotten buggy and makes it hard to binge play like before.","I love this game I really do. I've been pkaying it for a few years now, but it's gotten a bit buggier. Of course thats expected with the zoos getting larger, but my biggest problem right now is the ads. To retry you need to watch an ad, but you are unable to close the ad after its finished. So you restart the game, and have to rewatch the ad to play once again. Please fix this! I love the new ocean map but it sucks that I can barely play it."],"appId":"com.yodo1.rodeo.safari","url":"https://play.google.com/store/apps/details?id=com.yodo1.rodeo.safari&hl=en&gl=us"},"com.sparklingsociety.cityisland5":{"title":"City Island 5 - Building Sim","description":"Build a city, your city\n“City Island 5 - Tycoon Building Simulation Offline”, a new city builder game from Sparkling Society, will make you the mayor of small town starting on just one island. Send your airship to explore the world and unlock beautiful new islands to build your new cities on. In most city building games you are just managing one city, but in “City Island 5 - Offline Tycoon Building Sim Game” you will be expanding your horizon and skylines to new islands, each with a different theme and surface to build a city on. This city game is also playable as an offline game, so you can build your own city without internet or when you have no wifi connection. Join millions of players with the most popular casual city building game series on mobile! \n\nFrom a town, to a city, to a metropolis\nYour town city will start small as a village, but your cities will grow larger by placing more buildings, and unlocking new islands. Building games in the City Island sim games series are well known for their very rewarding free to play offline games, packed with quests and loads of content, with always something to do. Visit the towns and cities of your neighbours or visit my city.\n\nCity building with a goal, with a purpose\nThese simulation city builder games fall into the category: fun casual offline city building games for free. So this means that you’ll never get bored playing “City Island 5 - Offline Tycoon Building Sim Game”! Next to the hundreds of buildings to unlock, this island city builder games has dozens of quests to earn treasure chests packed with very cool stuff. Design and build your island city the way you want, and play with friends to help each other. These casual tycoon simulation games come with a lot of cool buildings and islands to unlock and will definitely make you stick around for long sessions to collect loads of money to make your town and cities grow and design them however you want to build a city.\n\n“City Island 5 - Tycoon Building Simulation Offline” City Builder Games Features: \n▶ Collect, upgrade, decorate, explore in this complete construction simulation game! \n▶ Collect rewards and earn treasure chests! \n▶ Play this game offline or online. No internet connection required to play\n▶ City builder games made fun again with dozens of cool islands to build your city on! \n▶ Build your own city and watch other players’ cities as well!\n▶ Don’t forget to rate us or give us feedback!","descriptionHTML":"<b>Build a city, your city</b><br><i>“City Island 5 - Tycoon Building Simulation Offline”</i>, a new city builder game from Sparkling Society, will make you the mayor of small town starting on just one island. Send your airship to explore the world and unlock beautiful new islands to build your new cities on. In most city building games you are just managing one city, but in <i>“City Island 5 - Offline Tycoon Building Sim Game”</i> you will be expanding your horizon and skylines to new islands, each with a different theme and surface to build a city on. This city game is also playable as an offline game, so you can build your own city without internet or when you have no wifi connection. Join millions of players with the most popular casual city building game series on mobile! <br><br><b>From a town, to a city, to a metropolis</b><br>Your town city will start small as a village, but your cities will grow larger by placing more buildings, and unlocking new islands. Building games in the <i>City Island</i> sim games series are well known for their very rewarding free to play offline games, packed with quests and loads of content, with always something to do. Visit the towns and cities of your neighbours or visit my city.<br><br><b>City building with a goal, with a purpose</b><br>These simulation city builder games fall into the category: fun casual offline city building games for free. So this means that you’ll never get bored playing <i>“City Island 5 - Offline Tycoon Building Sim Game”</i>! Next to the hundreds of buildings to unlock, this island city builder games has dozens of quests to earn treasure chests packed with very cool stuff. Design and build your island city the way you want, and play with friends to help each other. These casual tycoon simulation games come with a lot of cool buildings and islands to unlock and will definitely make you stick around for long sessions to collect loads of money to make your town and cities grow and design them however you want to build a city.<br><br><i>“City Island 5 - Tycoon Building Simulation Offline”</i> <b>City Builder Games Features</b>: <br>▶ Collect, upgrade, decorate, explore in this complete construction simulation game! <br>▶ Collect rewards and earn treasure chests! <br>▶ Play this game offline or online. No internet connection required to play<br>▶ City builder games made fun again with dozens of cool islands to build your city on! <br>▶ Build your own city and watch other players’ cities as well!<br>▶ Don’t forget to rate us or give us feedback!","summary":"Offline City Building Simulator. Grow your town into a city on multiple islands!","installs":"10,000,000+","minInstalls":10000000,"maxInstalls":15469437,"score":4.552303,"scoreText":"4.6","ratings":380050,"reviews":9610,"histogram":{"1":16409,"2":8272,"3":16545,"4":46538,"5":292257},"price":0,"free":true,"currency":"USD","priceText":"Free","available":true,"offersIAP":true,"IAPRange":"$0.99 - $104.99 per item","androidVersion":"5.0","androidVersionText":"5.0","developer":"Sparkling Society - Build Town City Building Games","developerId":"8369629392252386483","developerEmail":"android-towncitybrawl@sparklingsociety.net","developerWebsite":"http://www.sparklingsociety.net","developerAddress":"Drie Akersstraat 13\n2611 JR Delft\nNederland","privacyPolicy":"http://www.sparklingsociety.net/privacy-policy/","developerInternalID":"8369629392252386483","genre":"Simulation","genreId":"GAME_SIMULATION","icon":"https://play-lh.googleusercontent.com/DhfdtXXFf3mlghW4ZQfIytET-QEJnO42jeXXzNxC5ZVQOCDppune4E-LYFqwCrwwjnM","headerImage":"https://play-lh.googleusercontent.com/COFQwqJNSifAffukAShc2TywYNKrKk63kcnS9Q60PabTldRIhOCGdtIYAXoljqk2nGE","screenshots":["https://play-lh.googleusercontent.com/rzwQ8P-SYRX1GNjU6juKoxJh3OFJDbQuxqFXkOpsqs9XpcJbpOY7-AlB-Fe0tRBLmBce","https://play-lh.googleusercontent.com/-TvPv77yxxAIJvfGafubHZKSX7epCZk4-WAAvb9kWgGWooKUhSMN8tR0E0ybWmXyJX8","https://play-lh.googleusercontent.com/ALuANYWLip2yq596yoRrF1oH96T5W8IPW6i4xYQBvxXdtNg3kQelfXMZfmKoFq0PvIk","https://play-lh.googleusercontent.com/tXaeqK4kb1Bjch_qwyTclRJ2HFQzxj2YLjl4d4NYjqfGzAvv54zPvTwESyjt9-eNcJop","https://play-lh.googleusercontent.com/RNvNJaHlyFPYj4O6cQAJsNrfz2VyFvLnA_EWdtxDeGOF_n5WbjTN7t1cDYOS0CGwX64","https://play-lh.googleusercontent.com/1UUaaQgdq-f5Iki7cA41J0HcNi3GdZ0IgnzUgoy3R-2MzOf3M84SbaylcZI04TW0laM","https://play-lh.googleusercontent.com/5JnCS7v5BQOg8BI2amyzYcB7Oc30Ye3z2uv1d9Ki3w-x1Vt9vPQOCnTG83aaRcR1diE","https://play-lh.googleusercontent.com/fQDSEkN2yCnFAEATCOmBJSWZs44n9rB2XmJQHdb_4l0DNunSlBDVsNBA8-zitoG9t27f","https://play-lh.googleusercontent.com/LfNE3r7Bt6EogEUK2ysrl3peXa9e0jgxzggLdPNbOVmC-4PCTqIM0da0Y3p7EPdEcQ","https://play-lh.googleusercontent.com/j6d0XGtsclmZ0uwBrZN8Hy-wYLF-PFyUIBiMcZN2NbTzNN1_hqu2MGGTuMXBmL_fOz4","https://play-lh.googleusercontent.com/YfryKZd_BY3_BkXhvmvxs5q62XnolRN2CfVBg7G-_Vnre5qr95ZTULnuL_MNetIfYUc","https://play-lh.googleusercontent.com/UKKrpr7sPyZEMvFD_9XLm8w3WQH_sVkpVTfI0VJNABGAZgKRV2weOU6oeLa8VEhGnBk","https://play-lh.googleusercontent.com/pzo9YjlKKkIdcAUIM49zHNj0ng3JK8NUsUCnfkWlsNWlZeZMgqoc_Om_w0008o1zqGE","https://play-lh.googleusercontent.com/KxIb4VIbMrntnVx9c8H_TNco5ynY0a33nrTMQSkunTwhqR0MXtdHE2vCL0Dt6MvEN1A","https://play-lh.googleusercontent.com/SrEV19bHXd47WJJciSMHPm0qbjZjZJPlgiZRjp2MWc93FfuA8EAK0lZtEn7C70hyACA","https://play-lh.googleusercontent.com/x0TrGAJJw2O9rOMolIdFQ60gMpa9ok6igzT6kV6T-2ud5Xd6QmbgL4tzdgFgS6cP9VY","https://play-lh.googleusercontent.com/1jNC2b_Hzhe5UZoxRwT0jWdUq9eYhO0PgUbFdNMChQ07cJg7zTpFG4vu9TVibf6P9Gg","https://play-lh.googleusercontent.com/zoIYs6TC0WORP51-1BuMkHakGC4htOoT52TXzsRyO-FODSidDNWsbDEzjio5JjPQsL1R","https://play-lh.googleusercontent.com/mLaLcNPhMqu2dj8jgocRwDFjqMOgP7eQQK8a-XdDy2JFY_4OVBY5tky0MltCL4LziQ","https://play-lh.googleusercontent.com/KiGj5xKK0fFgaYQavh3amQF_t7_TWQ85H5wJJYycFiy-p16JgrPqW4gYKDf5KJTh2W4R","https://play-lh.googleusercontent.com/juLpas4nVUn2zAvEOKJ_89VceL0dlQpZUgWbzSQiX8D7-1Wjr_EJEUe8AHsyJ_5EAMs","https://play-lh.googleusercontent.com/ytSqMVC6sFqwvKACIOCgwvCR2Yv7F-rolY-kFDrZWhYZWlt_0wpn55-q423yYJVNbC4","https://play-lh.googleusercontent.com/iCl-xPvu3Bst2_jtvob01o_kbI3xzXhAnR8pFLWIDmR87CaTZtJcWhcolipnxp-JpZg","https://play-lh.googleusercontent.com/kw27N46tuBOeYNJdEJH-uVRdLaruoQROO1wLiAbOCo5MtU8O4SzCMC84xwqCstulDg"],"video":"https://www.youtube.com/embed/1icnqPxdfMU?ps=play&vq=large&rel=0&autohide=1&showinfo=0","videoImage":"https://play-lh.googleusercontent.com/COFQwqJNSifAffukAShc2TywYNKrKk63kcnS9Q60PabTldRIhOCGdtIYAXoljqk2nGE","contentRating":"Everyone","adSupported":true,"released":"Dec 16, 2018","updated":1660921652000,"version":"3.30.1","recentChanges":"✨ New! Crooks are on the loose! You can now catch thieves running through your city!<br>✨ New! 100 extra levels! You can now continue playing to level 250!<br>🔧 Fixed issue that the screen would darken when entering an island<br>🔧 Fixed issue that the game would crash when opening Daily Quests<br>🔧 Fixed crash that would sometimes occur from the Quests window<br>🔧 Fixed rare crash when showing wave text animation<br>🔧 Fixed crash that could occur during the tutorial<br>🔧 Fixed crash when sending gifts","comments":["The game has become way less fun. The constant, incessant ads that randomly pop up, that are required for getting any rewards has almost made this game unplayable. The events are now just repetitive and trite. I don't see myself playing this game much longer. Enjoyable game to pass the time if you like these kind of sims. A little too easy to click the wrong button and spend coins or keys you're trying to save up, but otherwise no major issues.","Follow up from April. Date 8/23/22, Still crashing at random. Just did the update an was hoping it would help. It didn't which is disappointing. Still don't have the rare decorations. I do like the Catch the crook.. please help! 4/27/22. The game has crashed 6 times in the last 13 minutes. I keep writing reviews & writing to the developers but it is being deleted or removed. This is irritating !! An way too many pop up ads even for a \"free\" game. Especially one that you make purchases in","It's a really fun game but realistically it takes too long to get to certain levels. For example with the snow level it asked for Community buildings I'm in level 16 but I have to wait to get to level 34 to get Community Builders realistically that's too long and I don't know if I'll be interested in keep doing it by then. It's too hard to earn the dollar gold coins and requires too many coins to achieve things.","Good features and and not so good. It is tough to make a game with the right reward to longevity ratio. This game makes a decent attempt. 🤔 The Good -Nice graphics😁 -Nice concept of multiple islands with different characteristics.🙂 The Bad -No help file (that I could find) to describe the meaning of things. 🤔 -Does not automatically collect profits. Forces you to constantly touch screen, for me very annoying. 🤨 -Cars driving around forces you to constantly tap screen. Again annoying. 😒","Been enjoying the game for about 3 hours over a day /half making steady progress. One might initially think it's a money grab but with a little patience and quest completion there's plenty of cash to be made for further advancement. I really appreciate the amount of buildings that can construct and/or upgrade simultaneously. I will have to research what a couple of the road options are for but for now I Think I found a game I'll put some spare time in to."],"appId":"com.sparklingsociety.cityisland5","url":"https://play.google.com/store/apps/details?id=com.sparklingsociety.cityisland5&hl=en&gl=us"}}